$VAR1 = {
          'ABI_DUMPER_VERSION' => '1.4',
          'ABI_DUMP_VERSION' => '3.5',
          'Arch' => 'x86_64',
          'GccVersion' => '15.2.0',
          'Headers' => {
                         'layersurface.h' => 1,
                         'lockscreen-manager.h' => 1,
                         'lockscreen.h' => 1,
                         'quick-setting.h' => 1,
                         'screenshot-manager.h' => 1,
                         'shell.h' => 1,
                         'status-icon.h' => 1,
                         'status-page.h' => 1,
                         'wall-clock.h' => 1
                       },
          'Language' => 'C',
          'LibraryName' => 'libphosh-0.45.so.0',
          'LibraryVersion' => '0.51.rc1',
          'NameSpaces' => {},
          'Needed' => {
                        'libappstream.so.5' => 1,
                        'libc.so.6' => 1,
                        'libcairo.so.2' => 1,
                        'libcallaudio-0.1.so.0' => 1,
                        'libfeedback-0.0.so.0' => 1,
                        'libfribidi.so.0' => 1,
                        'libgcr-base-3.so.1' => 1,
                        'libgcr-ui-3.so.1' => 1,
                        'libgdk-3.so.0' => 1,
                        'libgdk_pixbuf-2.0.so.0' => 1,
                        'libgio-2.0.so.0' => 1,
                        'libglib-2.0.so.0' => 1,
                        'libgmobile.so.0' => 1,

                                                   'phosh_util_append_to_strv@@LIBPHOSH_0_45_0' => 1,
                                                   'phosh_util_calculate_supported_mode_scales@@LIBPHOSH_0_45_0' => 1,
                                                   'phosh_util_data_uri_to_pixbuf@@LIBPHOSH_0_45_0' => 1,
                                                   'phosh_util_escape_markup@@LIBPHOSH_0_45_0' => 1,
                                                   'phosh_util_file_equal@@LIBPHOSH_0_45_0' => 1,
                                                   'phosh_util_gesture_is_touch@@LIBPHOSH_0_45_0' => 1,
                                                   'phosh_util_get_icon_by_wifi_strength@@LIBPHOSH_0_45_0' => 1,
                                                   'phosh_util_have_gnome_software@@LIBPHOSH_0_45_0' => 1,
                                                   'phosh_util_matches_app_info@@LIBPHOSH_0_45_0' => 1,
                                                   'phosh_util_open_mobile_settings_panel@@LIBPHOSH_0_45_0' => 1,
                                                   'phosh_util_open_settings_panel@@LIBPHOSH_0_45_0' => 1,
                                                   'phosh_util_remove_from_strv@@LIBPHOSH_0_45_0' => 1,
                                                   'phosh_util_toggle_style_class@@LIBPHOSH_0_45_0' => 1,
                                                   'phosh_wall_clock_get_clock@@LIBPHOSH_0_45_0' => 1,
                                                   'phosh_wall_clock_get_default@@LIBPHOSH_0_45_0' => 1,
                                                   'phosh_wall_clock_get_type@@LIBPHOSH_0_45_0' => 1,
                                                   'phosh_wall_clock_local_date@@LIBPHOSH_0_45_0' => 1,
                                                   'phosh_wall_clock_new@@LIBPHOSH_0_45_0' => 1,
                                                   'phosh_wall_clock_set_default@@LIBPHOSH_0_45_0' => 1,
                                                   'phosh_wall_clock_string_for_datetime@@LIBPHOSH_0_45_0' => 1,
                                                   'phosh_wifi_manager_get_enabled@@LIBPHOSH_0_45_0' => 1,
                                                   'phosh_wifi_manager_get_state@@LIBPHOSH_0_45_0' => 1,
                                                   'phosh_wifi_manager_is_hotspot_master@@LIBPHOSH_0_45_0' => 1,
                                                   'phosh_wifi_manager_set_hotspot_master@@LIBPHOSH_0_45_0' => 1,
                                                   'phosh_wwan_has_data@@LIBPHOSH_0_45_0' => 1,
                                                   'phosh_wwan_is_enabled@@LIBPHOSH_0_45_0' => 1,
                                                   'phosh_wwan_is_unlocked@@LIBPHOSH_0_45_0' => 1,
                                                   'phosh_wwan_set_data_enabled@@LIBPHOSH_0_45_0' => 1
                                                 }
                       },
          'Target' => 'unix',
          'TypeInfo' => {
                          '1' => {
                                   'Name' => 'void',
                                   'Type' => 'Intrinsic'
                                 },
                          '1043401' => {
                                         'BaseType' => '1043413',
                                         'Header' => 'gliststore.h',
                                         'Line' => '38',
                                         'Name' => 'GListStore',
                                         'PrivateABI' => 1,
                                         'Type' => 'Typedef'
                                       },
                          '1043413' => {
                                         'Name' => 'struct _GListStore',
                                         'PrivateABI' => 1,
                                         'Type' => 'Struct'
                                       },
                          '1043430' => {
                                         'BaseType' => '1043401',
                                         'Name' => 'GListStore*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1057' => {
                                      'BaseType' => '1069',
                                      'Header' => 'gmain.h',
                                      'Line' => '87',
                                      'Name' => 'GSourcePrivate',
                                      'PrivateABI' => 1,
                                      'Type' => 'Typedef'
                                    },
                          '1069' => {
                                      'Name' => 'struct _GSourcePrivate',
                                      'PrivateABI' => 1,
                                      'Type' => 'Struct'
                                    },
                          '1071186' => {
                                         'BaseType' => '1071198',
                                         'Header' => 'status-page.h',
                                         'Line' => '14',
                                         'Name' => 'PhoshStatusPage',
                                         'Size' => '48',
                                         'Type' => 'Typedef'
                                       },
                          '1071198' => {
                                         'Header' => 'status-page.h',
                                         'Line' => '14',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'parent_instance',
                                                              'offset' => '0',
                                                              'type' => '960820'
                                                            }
                                                   },
                                         'Name' => 'struct _PhoshStatusPage',
                                         'Size' => '48',
                                         'Type' => 'Struct'
                                       },
                          '1074' => {
                                      'BaseType' => '1086',
                                      'Header' => 'gmain.h',
                                      'Line' => '99',
                                      'Name' => 'GSourceCallbackFuncs',
                                      'PrivateABI' => 1,
                                      'Size' => '24',
                                      'Type' => 'Typedef'
                                    },
                          '1086' => {
                                      'Header' => 'gmain.h',
                                      'Line' => '292',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'ref',
                                                           'offset' => '0',
                                                           'type' => '406'
                                                         },
                                                  '1' => {
                                                           'name' => 'unref',
                                                           'offset' => '8',
                                                           'type' => '406'
                                                         },
                                                  '2' => {
                                                           'name' => 'get',
                                                           'offset' => '22',
                                                           'type' => '1343'
                                                         }
                                                },
                                      'Name' => 'struct _GSourceCallbackFuncs',
                                      'PrivateABI' => 1,
                                      'Size' => '24',
                                      'Type' => 'Struct'
                                    },
                          '1126198' => {
                                         'Header' => 'animation.h',
                                         'Line' => '30',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'PHOSH_ANIMATION_TYPE_EASE_OUT_CUBIC',
                                                              'value' => '0'
                                                            },
                                                     '1' => {
                                                              'name' => 'PHOSH_ANIMATION_TYPE_EASE_IN_QUINTIC',
                                                              'value' => '1'
                                                            },
                                                     '2' => {
                                                              'name' => 'PHOSH_ANIMATION_TYPE_EASE_OUT_QUINTIC',
                                                              'value' => '2'
                                                            },
                                                     '3' => {
                                                              'name' => 'PHOSH_ANIMATION_TYPE_EASE_OUT_BOUNCE',
                                                              'value' => '3'
                                                            }
                                                   },
                                         'Name' => 'enum PhoshAnimationType',
                                         'PrivateABI' => 1,
                                         'Size' => '4',
                                         'Type' => 'Enum'
                                       },
                          '1126210' => {
                                         'BaseType' => '1126222',
                                         'Header' => 'animation.h',
                                         'Line' => '32',
                                         'Name' => 'PhoshAnimation',
                                         'PrivateABI' => 1,
                                         'Type' => 'Typedef'
                                       },
                          '1126222' => {
                                         'Line' => '16',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'ref_count',
                                                              'offset' => '0',
                                                              'type' => '2155560'
                                                            },
                                                     '1' => {
                                                              'name' => 'widget',
                                                              'offset' => '8',
                                                              'type' => '943522'
                                                            },
                                                     '10' => {
                                                               'name' => 'done_cb',
                                                               'offset' => '128',
                                                               'type' => '1126260'
                                                             },
                                                     '11' => {
                                                               'name' => 'user_data',
                                                               'offset' => '136',
                                                               'type' => '327'
                                                             },
                                                     '2' => {
                                                              'name' => 'value',
                                                              'offset' => '22',
                                                              'type' => '320'
                                                            },
                                                     '3' => {
                                                              'name' => 'value_from',
                                                              'offset' => '36',
                                                              'type' => '320'
                                                            },
                                                     '4' => {
                                                              'name' => 'value_to',
                                                              'offset' => '50',
                                                              'type' => '320'
                                                            },
                                                     '5' => {
                                                              'name' => 'duration',
                                                              'offset' => '64',
                                                              'type' => '140'
                                                            },
                                                     '6' => {
                                                              'name' => 'type',
                                                              'offset' => '72',
                                                              'type' => '1126198'
                                                            },
                                                     '7' => {
                                                              'name' => 'start_time',
                                                              'offset' => '86',
                                                              'type' => '140'
                                                            },
                                                     '8' => {
                                                              'name' => 'tick_cb_id',
                                                              'offset' => '100',
                                                              'type' => '277'
                                                            },
                                                     '9' => {
                                                              'name' => 'value_cb',
                                                              'offset' => '114',
                                                              'type' => '1126227'
                                                            }
                                                   },
                                         'Name' => 'struct _PhoshAnimation',
                                         'PrivateABI' => 1,
                                         'Size' => '96',
                                         'Source' => 'animation.c',
                                         'Type' => 'Struct'
                                       },
                          '1126227' => {
                                         'BaseType' => '1126239',
                                         'Header' => 'animation.h',
                                         'Line' => '34',
                                         'Name' => 'PhoshAnimationValueCallback',
                                         'PrivateABI' => 1,
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1126239' => {
                                         'Name' => 'void(*)(double, gpointer)',
                                         'Param' => {
                                                      '0' => {
                                                               'type' => '320'
                                                             },
                                                      '1' => {
                                                               'type' => '327'
                                                             }
                                                    },
                                         'Return' => '1',
                                         'Size' => '8',
                                         'Type' => 'FuncPtr'
                                       },
                          '1126260' => {
                                         'BaseType' => '406',
                                         'Header' => 'animation.h',
                                         'Line' => '36',
                                         'Name' => 'PhoshAnimationDoneCallback',
                                         'PrivateABI' => 1,
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1126272' => {
                                         'BaseType' => '1126210',
                                         'Name' => 'PhoshAnimation*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1127280' => {
                                         'BaseType' => '1127292',
                                         'Header' => 'fader.h',
                                         'Line' => '16',
                                         'Name' => 'PhoshFader',
                                         'PrivateABI' => 1,
                                         'Size' => '88',
                                         'Type' => 'Typedef'
                                       },
                          '1127292' => {
                                         'Line' => '39',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'parent',
                                                              'offset' => '0',
                                                              'type' => '960916'
                                                            },
                                                     '1' => {
                                                              'name' => 'monitor',
                                                              'offset' => '86',
                                                              'type' => '961675'
                                                            },
                                                     '2' => {
                                                              'name' => 'style_class',
                                                              'offset' => '100',
                                                              'type' => '190'
                                                            },
                                                     '3' => {
                                                              'name' => 'fadeout',
                                                              'offset' => '114',
                                                              'type' => '1126272'
                                                            },
                                                     '4' => {
                                                              'name' => 'fade_out_time',
                                                              'offset' => '128',
                                                              'type' => '277'
                                                            },
                                                     '5' => {
                                                              'name' => 'fade_out_type',
                                                              'offset' => '132',
                                                              'type' => '1126198'
                                                            }
                                                   },
                                         'Name' => 'struct _PhoshFader',
                                         'PrivateABI' => 1,
                                         'Size' => '88',
                                         'Source' => 'fader.c',
                                         'Type' => 'Struct'
                                       },
                          '1127420' => {
                                         'BaseType' => '1127280',
                                         'Name' => 'PhoshFader*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1132751' => {
                                         'Header' => 'gdesktop-enums.h',
                                         'Line' => '83',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'G_DESKTOP_CLOCK_FORMAT_24H',
                                                              'value' => '0'
                                                            },
                                                     '1' => {
                                                              'name' => 'G_DESKTOP_CLOCK_FORMAT_12H',
                                                              'value' => '1'
                                                            }
                                                   },
                                         'Name' => 'enum GDesktopClockFormat',
                                         'PrivateABI' => 1,
                                         'Size' => '4',
                                         'Type' => 'Enum'
                                       },
                          '1133087' => {
                                         'BaseType' => '1133099',
                                         'Header' => 'gdatetime.h',
                                         'Line' => '122',
                                         'Name' => 'GDateTime',
                                         'PrivateABI' => 1,
                                         'Type' => 'Typedef'
                                       },
                          '1133099' => {
                                         'Name' => 'struct _GDateTime',
                                         'PrivateABI' => 1,
                                         'Type' => 'Struct'
                                       },
                          '1133268' => {
                                         'BaseType' => '1133087',
                                         'Name' => 'GDateTime*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1134863' => {
                                         'BaseType' => '1134875',
                                         'Header' => 'wall-clock.h',
                                         'Line' => '17',
                                         'Name' => 'PhoshWallClock',
                                         'Size' => '24',
                                         'Type' => 'Typedef'
                                       },
                          '1134875' => {
                                         'Header' => 'wall-clock.h',
                                         'Line' => '17',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'parent_instance',
                                                              'offset' => '0',
                                                              'type' => '3321'
                                                            }
                                                   },
                                         'Name' => 'struct _PhoshWallClock',
                                         'Size' => '24',
                                         'Type' => 'Struct'
                                       },
                          '1135071' => {
                                         'BaseType' => '1134863',
                                         'Name' => 'PhoshWallClock*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1143' => {
                                      'BaseType' => '1160',
                                      'Header' => 'gmain.h',
                                      'Line' => '158',
                                      'Name' => 'GSourceFuncs',
                                      'PrivateABI' => 1,
                                      'Size' => '48',
                                      'Type' => 'Typedef'
                                    },
                          '1155' => {
                                      'BaseType' => '1143',
                                      'Name' => 'GSourceFuncs const',
                                      'Size' => '48',
                                      'Type' => 'Const'
                                    },
                          '1158499' => {
                                         'BaseType' => '37359',
                                         'Header' => 'gstrfuncs.h',
                                         'Line' => '354',
                                         'Name' => 'GStrv',
                                         'PrivateABI' => 1,
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1160' => {
                                      'Header' => 'gmain.h',
                                      'Line' => '399',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'prepare',
                                                           'offset' => '0',
                                                           'type' => '1361'
                                                         },
                                                  '1' => {
                                                           'name' => 'check',
                                                           'offset' => '8',
                                                           'type' => '1404'
                                                         },
                                                  '2' => {
                                                           'name' => 'dispatch',
                                                           'offset' => '22',
                                                           'type' => '1437'
                                                         },
                                                  '3' => {
                                                           'name' => 'finalize',
                                                           'offset' => '36',
                                                           'type' => '1480'
                                                         },
                                                  '4' => {
                                                           'name' => 'closure_callback',
                                                           'offset' => '50',
                                                           'type' => '1259'
                                                         },
                                                  '5' => {
                                                           'name' => 'closure_marshal',
                                                           'offset' => '64',
                                                           'type' => '1348'
                                                         }
                                                },
                                      'Name' => 'struct _GSourceFuncs',
                                      'PrivateABI' => 1,
                                      'Size' => '48',
                                      'Type' => 'Struct'
                                    },
                          '1172435' => {
                                         'BaseType' => '1172447',
                                         'Header' => 'gtkbox.h',
                                         'Line' => '47',
                                         'Name' => 'GtkBox',
                                         'PrivateABI' => 1,
                                         'Size' => '48',
                                         'Type' => 'Typedef'
                                       },
                          '1172447' => {
                                         'Header' => 'gtkbox.h',
                                         'Line' => '51',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'container',
                                                              'offset' => '0',
                                                              'type' => '960746'
                                                            },
                                                     '1' => {
                                                              'name' => 'priv',
                                                              'offset' => '64',
                                                              'type' => '1172504'
                                                            }
                                                   },
                                         'Name' => 'struct _GtkBox',
                                         'PrivateABI' => 1,
                                         'Size' => '48',
                                         'Type' => 'Struct'
                                       },
                          '1172487' => {
                                         'BaseType' => '1172499',
                                         'Header' => 'gtkbox.h',
                                         'Line' => '48',
                                         'Name' => 'GtkBoxPrivate',
                                         'PrivateABI' => 1,
                                         'Type' => 'Typedef'
                                       },
                          '1172499' => {
                                         'Name' => 'struct _GtkBoxPrivate',
                                         'PrivateABI' => 1,
                                         'Type' => 'Struct'
                                       },
                          '1172504' => {
                                         'BaseType' => '1172487',
                                         'Name' => 'GtkBoxPrivate*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '121' => {
                                     'BaseType' => '133',
                                     'Header' => 'glibconfig.h',
                                     'Line' => '57',
                                     'Name' => 'guint32',
                                     'PrivateABI' => 1,
                                     'Size' => '4',
                                     'Type' => 'Typedef'
                                   },
                          '1220475' => {
                                         'BaseType' => '935031',
                                         'Name' => 'GdkRectangle const',
                                         'Size' => '16',
                                         'Type' => 'Const'
                                       },
                          '1221462' => {
                                         'BaseType' => '1220475',
                                         'Name' => 'GdkRectangle const*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1221467' => {
                                         'BaseType' => '935031',
                                         'Name' => 'GdkRectangle*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1259' => {
                                      'BaseType' => '754',
                                      'Header' => 'gmain.h',
                                      'Line' => '200',
                                      'Name' => 'GSourceFunc',
                                      'PrivateABI' => 1,
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '1271' => {
                                      'Name' => 'void(*)(GSource*)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '1287'
                                                          }
                                                 },
                                      'Return' => '1',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '1271215' => {
                                         'BaseType' => '1271232',
                                         'Header' => 'gdk-pixbuf-core.h',
                                         'Line' => '89',
                                         'Name' => 'GdkPixbuf',
                                         'PrivateABI' => 1,
                                         'Type' => 'Typedef'
                                       },
                          '1271232' => {
                                         'Name' => 'struct _GdkPixbuf',
                                         'PrivateABI' => 1,
                                         'Type' => 'Struct'
                                       },
                          '1271237' => {
                                         'BaseType' => '1271215',
                                         'Name' => 'GdkPixbuf*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1277977' => {
                                         'BaseType' => '1277989',
                                         'Header' => 'background-image.h',
                                         'Line' => '17',
                                         'Name' => 'PhoshBackgroundImage',
                                         'PrivateABI' => 1,
                                         'Type' => 'Typedef'
                                       },
                          '1277989' => {
                                         'Line' => '30',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'parent',
                                                              'offset' => '0',
                                                              'type' => '3321'
                                                            },
                                                     '1' => {
                                                              'name' => 'file',
                                                              'offset' => '36',
                                                              'type' => '960325'
                                                            },
                                                     '2' => {
                                                              'name' => 'pixbuf',
                                                              'offset' => '50',
                                                              'type' => '1271237'
                                                            },
                                                     '3' => {
                                                              'name' => 'load_timer',
                                                              'offset' => '64',
                                                              'type' => '2202257'
                                                            }
                                                   },
                                         'Name' => 'struct _PhoshBackgroundImage',
                                         'PrivateABI' => 1,
                                         'Size' => '48',
                                         'Source' => 'background-image.c',
                                         'Type' => 'Struct'
                                       },
                          '1277994' => {
                                         'BaseType' => '1277977',
                                         'Name' => 'PhoshBackgroundImage*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1287' => {
                                      'BaseType' => '848',
                                      'Name' => 'GSource*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '1287258' => {
                                         'Header' => 'lockscreen.h',
                                         'Line' => '27',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'PHOSH_LOCKSCREEN_PAGE_INFO',
                                                              'value' => '0'
                                                            },
                                                     '1' => {
                                                              'name' => 'PHOSH_LOCKSCREEN_PAGE_EXTRA',
                                                              'value' => '1'
                                                            },
                                                     '2' => {
                                                              'name' => 'PHOSH_LOCKSCREEN_PAGE_UNLOCK',
                                                              'value' => '2'
                                                            }
                                                   },
                                         'Name' => 'enum PhoshLockscreenPage',
                                         'Size' => '4',
                                         'Type' => 'Enum'
                                       },
                          '1287270' => {
                                         'BaseType' => '1287282',
                                         'Header' => 'lockscreen.h',
                                         'Line' => '31',
                                         'Name' => 'PhoshLockscreen',
                                         'Size' => '56',
                                         'Type' => 'Typedef'
                                       },
                          '1287282' => {
                                         'Header' => 'lockscreen.h',
                                         'Line' => '31',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'parent_instance',
                                                              'offset' => '0',
                                                              'type' => '960916'
                                                            }
                                                   },
                                         'Name' => 'struct _PhoshLockscreen',
                                         'Size' => '56',
                                         'Type' => 'Struct'
                                       },
                          '1287309' => {
                                         'BaseType' => '1287270',
                                         'Name' => 'PhoshLockscreen*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1287314' => {
                                         'BaseType' => '1287326',
                                         'Header' => 'lockscreen-manager.h',
                                         'Line' => '14',
                                         'Name' => 'PhoshLockscreenManager',
                                         'Size' => '112',
                                         'Type' => 'Typedef'
                                       },
                          '1287326' => {
                                         'Line' => '56',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'parent',
                                                              'offset' => '0',
                                                              'type' => '3321'
                                                            },
                                                     '1' => {
                                                              'name' => 'lockscreen',
                                                              'offset' => '36',
                                                              'type' => '1287309'
                                                            },
                                                     '10' => {
                                                               'name' => 'locking',
                                                               'offset' => '146',
                                                               'type' => '253'
                                                             },
                                                     '11' => {
                                                               'name' => 'active_time',
                                                               'offset' => '150',
                                                               'type' => '140'
                                                             },
                                                     '12' => {
                                                               'name' => 'calls_manager',
                                                               'offset' => '260',
                                                               'type' => '1287571'
                                                             },
                                                     '2' => {
                                                              'name' => 'shields',
                                                              'offset' => '50',
                                                              'type' => '933217'
                                                            },
                                                     '3' => {
                                                              'name' => 'bg_settings',
                                                              'offset' => '64',
                                                              'type' => '960396'
                                                            },
                                                     '4' => {
                                                              'name' => 'bg_file',
                                                              'offset' => '72',
                                                              'type' => '960325'
                                                            },
                                                     '5' => {
                                                              'name' => 'bg_file_monitor',
                                                              'offset' => '86',
                                                              'type' => '960352'
                                                            },
                                                     '6' => {
                                                              'name' => 'bg_style',
                                                              'offset' => '100',
                                                              'type' => '961736'
                                                            },
                                                     '7' => {
                                                              'name' => 'cached_bg_image',
                                                              'offset' => '114',
                                                              'type' => '1277994'
                                                            },
                                                     '8' => {
                                                              'name' => 'bg_load_cancel',
                                                              'offset' => '128',
                                                              'type' => '4850'
                                                            },
                                                     '9' => {
                                                              'name' => 'locked',
                                                              'offset' => '136',
                                                              'type' => '253'
                                                            }
                                                   },
                                         'Name' => 'struct _PhoshLockscreenManager',
                                         'PrivateABI' => 1,
                                         'Size' => '112',
                                         'Source' => 'lockscreen-manager.c',
                                         'Type' => 'Struct'
                                       },
                          '1287544' => {
                                         'BaseType' => '1287314',
                                         'Name' => 'PhoshLockscreenManager*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1287554' => {
                                         'BaseType' => '1287566',
                                         'Header' => 'calls-manager.h',
                                         'Line' => '36',
                                         'Name' => 'PhoshCallsManager',
                                         'PrivateABI' => 1,
                                         'Type' => 'Typedef'
                                       },
                          '1287566' => {
                                         'Line' => '51',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'parent',
                                                              'offset' => '0',
                                                              'type' => '961897'
                                                            },
                                                     '1' => {
                                                              'name' => 'present',
                                                              'offset' => '36',
                                                              'type' => '253'
                                                            },
                                                     '2' => {
                                                              'name' => 'incoming',
                                                              'offset' => '40',
                                                              'type' => '253'
                                                            },
                                                     '3' => {
                                                              'name' => 'active_call',
                                                              'offset' => '50',
                                                              'type' => '190'
                                                            },
                                                     '4' => {
                                                              'name' => 'om_client',
                                                              'offset' => '64',
                                                              'type' => '241203'
                                                            },
                                                     '5' => {
                                                              'name' => 'cancel',
                                                              'offset' => '72',
                                                              'type' => '4850'
                                                            },
                                                     '6' => {
                                                              'name' => 'calls',
                                                              'offset' => '86',
                                                              'type' => '1846'
                                                            },
                                                     '7' => {
                                                              'name' => 'calls_store',
                                                              'offset' => '100',
                                                              'type' => '1043430'
                                                            }
                                                   },
                                         'Name' => 'struct _PhoshCallsManager',
                                         'PrivateABI' => 1,
                                         'Size' => '72',
                                         'Source' => 'calls-manager.c',
                                         'Type' => 'Struct'
                                       },
                          '1287571' => {
                                         'BaseType' => '1287554',
                                         'Name' => 'PhoshCallsManager*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1292' => {
                                      'BaseType' => '1074',
                                      'Name' => 'GSourceCallbackFuncs*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '1297' => {
                                      'BaseType' => '1155',
                                      'Name' => 'GSourceFuncs const*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '1302' => {
                                      'BaseType' => '831',
                                      'Name' => 'GMainContext*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '1307' => {
                                      'BaseType' => '1057',
                                      'Name' => 'GSourcePrivate*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '133' => {
                                     'Name' => 'unsigned int',
                                     'Size' => '4',
                                     'Type' => 'Intrinsic'
                                   },
                          '1338' => {
                                      'BaseType' => '1259',
                                      'Name' => 'GSourceFunc*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '1343' => {
                                      'Name' => 'void(*)(gpointer, GSource*, GSourceFunc*, gpointer*)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '327'
                                                          },
                                                   '1' => {
                                                            'type' => '1287'
                                                          },
                                                   '2' => {
                                                            'type' => '1338'
                                                          },
                                                   '3' => {
                                                            'type' => '490'
                                                          }
                                                 },
                                      'Return' => '1',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '1348' => {
                                      'BaseType' => '577',
                                      'Header' => 'gmain.h',
                                      'Line' => '308',
                                      'Name' => 'GSourceDummyMarshal',
                                      'PrivateABI' => 1,
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '1355691' => {
                                         'BaseType' => '60',
                                         'Name' => 'int*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1361' => {
                                      'BaseType' => '1374',
                                      'Header' => 'gmain.h',
                                      'Line' => '334',
                                      'Name' => 'GSourceFuncsPrepareFunc',
                                      'PrivateABI' => 1,
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '1374' => {
                                      'Name' => 'gboolean(*)(GSource*, gint*)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '1287'
                                                          },
                                                   '1' => {
                                                            'type' => '1399'
                                                          }
                                                 },
                                      'Return' => '253',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '1392314' => {
                                         'BaseType' => '1392326',
                                         'Header' => 'gstring.h',
                                         'Line' => '43',
                                         'Name' => 'GString',
                                         'PrivateABI' => 1,
                                         'Size' => '24',
                                         'Type' => 'Typedef'
                                       },
                          '1392326' => {
                                         'Header' => 'gstring.h',
                                         'Line' => '45',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'str',
                                                              'offset' => '0',
                                                              'type' => '485'
                                                            },
                                                     '1' => {
                                                              'name' => 'len',
                                                              'offset' => '8',
                                                              'type' => '164'
                                                            },
                                                     '2' => {
                                                              'name' => 'allocated_len',
                                                              'offset' => '22',
                                                              'type' => '164'
                                                            }
                                                   },
                                         'Name' => 'struct _GString',
                                         'PrivateABI' => 1,
                                         'Size' => '24',
                                         'Type' => 'Struct'
                                       },
                          '1392379' => {
                                         'BaseType' => '1392314',
                                         'Name' => 'GString*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1394639' => {
                                         'BaseType' => '1394651',
                                         'Header' => 'giotypes.h',
                                         'Line' => '97',
                                         'Name' => 'GInputStream',
                                         'PrivateABI' => 1,
                                         'Size' => '32',
                                         'Type' => 'Typedef'
                                       },
                          '1394651' => {
                                         'Header' => 'ginputstream.h',
                                         'Line' => '44',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'parent_instance',
                                                              'offset' => '0',
                                                              'type' => '3321'
                                                            },
                                                     '1' => {
                                                              'name' => 'priv',
                                                              'offset' => '36',
                                                              'type' => '1394823'
                                                            }
                                                   },
                                         'Name' => 'struct _GInputStream',
                                         'PrivateABI' => 1,
                                         'Size' => '32',
                                         'Type' => 'Struct'
                                       },
                          '1394796' => {
                                         'BaseType' => '1394639',
                                         'Name' => 'GInputStream*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1394806' => {
                                         'BaseType' => '1394818',
                                         'Header' => 'ginputstream.h',
                                         'Line' => '42',
                                         'Name' => 'GInputStreamPrivate',
                                         'PrivateABI' => 1,
                                         'Type' => 'Typedef'
                                       },
                          '1394818' => {
                                         'Name' => 'struct _GInputStreamPrivate',
                                         'PrivateABI' => 1,
                                         'Type' => 'Struct'
                                       },
                          '1394823' => {
                                         'BaseType' => '1394806',
                                         'Name' => 'GInputStreamPrivate*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1399' => {
                                      'BaseType' => '241',
                                      'Name' => 'gint*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '140' => {
                                     'BaseType' => '46',
                                     'Header' => 'glibconfig.h',
                                     'Line' => '66',
                                     'Name' => 'gint64',
                                     'PrivateABI' => 1,
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '1404' => {
                                      'BaseType' => '1417',
                                      'Header' => 'gmain.h',
                                      'Line' => '355',
                                      'Name' => 'GSourceFuncsCheckFunc',
                                      'PrivateABI' => 1,
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '1417' => {
                                      'Name' => 'gboolean(*)(GSource*)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '1287'
                                                          }
                                                 },
                                      'Return' => '253',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '1437' => {
                                      'BaseType' => '1450',
                                      'Header' => 'gmain.h',
                                      'Line' => '380',
                                      'Name' => 'GSourceFuncsDispatchFunc',
                                      'PrivateABI' => 1,
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '1450' => {
                                      'Name' => 'gboolean(*)(GSource*, GSourceFunc, gpointer)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '1287'
                                                          },
                                                   '1' => {
                                                            'type' => '1259'
                                                          },
                                                   '2' => {
                                                            'type' => '327'
                                                          }
                                                 },
                                      'Return' => '253',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '1480' => {
                                      'BaseType' => '1271',
                                      'Header' => 'gmain.h',
                                      'Line' => '397',
                                      'Name' => 'GSourceFuncsFinalizeFunc',
                                      'PrivateABI' => 1,
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '152' => {
                                     'BaseType' => '53',
                                     'Header' => 'glibconfig.h',
                                     'Line' => '67',
                                     'Name' => 'guint64',
                                     'PrivateABI' => 1,
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '1632853' => {
                                         'BaseType' => '1632865',
                                         'Header' => 'screenshot-manager.h',
                                         'Line' => '17',
                                         'Name' => 'PhoshScreenshotManager',
                                         'Size' => '136',
                                         'Type' => 'Typedef'
                                       },
                          '1632865' => {
                                         'Line' => '85',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'parent',
                                                              'offset' => '0',
                                                              'type' => '801922'
                                                            },
                                                     '1' => {
                                                              'name' => 'dbus_name_id',
                                                              'offset' => '64',
                                                              'type' => '60'
                                                            },
                                                     '10' => {
                                                               'name' => 'action_names',
                                                               'offset' => '274',
                                                               'type' => '1158499'
                                                             },
                                                     '11' => {
                                                               'name' => 'settings',
                                                               'offset' => '288',
                                                               'type' => '960396'
                                                             },
                                                     '12' => {
                                                               'name' => 'cancel',
                                                               'offset' => '296',
                                                               'type' => '4850'
                                                             },
                                                     '2' => {
                                                              'name' => 'wl_scm',
                                                              'offset' => '72',
                                                              'type' => '1633709'
                                                            },
                                                     '3' => {
                                                              'name' => 'frames',
                                                              'offset' => '86',
                                                              'type' => '1633714'
                                                            },
                                                     '4' => {
                                                              'name' => 'slurp',
                                                              'offset' => '100',
                                                              'type' => '1633719'
                                                            },
                                                     '5' => {
                                                              'name' => 'fader',
                                                              'offset' => '114',
                                                              'type' => '1127420'
                                                            },
                                                     '6' => {
                                                              'name' => 'fader_id',
                                                              'offset' => '128',
                                                              'type' => '277'
                                                            },
                                                     '7' => {
                                                              'name' => 'opaque',
                                                              'offset' => '136',
                                                              'type' => '1127420'
                                                            },
                                                     '8' => {
                                                              'name' => 'opaque_id',
                                                              'offset' => '150',
                                                              'type' => '277'
                                                            },
                                                     '9' => {
                                                              'name' => 'for_clipboard',
                                                              'offset' => '260',
                                                              'type' => '1271237'
                                                            }
                                                   },
                                         'Name' => 'struct _PhoshScreenshotManager',
                                         'PrivateABI' => 1,
                                         'Size' => '136',
                                         'Source' => 'screenshot-manager.c',
                                         'Type' => 'Struct'
                                       },
                          '1633096' => {
                                         'BaseType' => '1632853',
                                         'Name' => 'PhoshScreenshotManager*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1633564' => {
                                         'Line' => '72',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'frames',
                                                              'offset' => '0',
                                                              'type' => '732'
                                                            },
                                                     '1' => {
                                                              'name' => 'invocation',
                                                              'offset' => '8',
                                                              'type' => '6022'
                                                            },
                                                     '2' => {
                                                              'name' => 'flash',
                                                              'offset' => '22',
                                                              'type' => '253'
                                                            },
                                                     '3' => {
                                                              'name' => 'filename',
                                                              'offset' => '36',
                                                              'type' => '190'
                                                            },
                                                     '4' => {
                                                              'name' => 'num_outputs',
                                                              'offset' => '50',
                                                              'type' => '277'
                                                            },
                                                     '5' => {
                                                              'name' => 'max_scale',
                                                              'offset' => '54',
                                                              'type' => '301'
                                                            },
                                                     '6' => {
                                                              'name' => 'area',
                                                              'offset' => '64',
                                                              'type' => '1221467'
                                                            },
                                                     '7' => {
                                                              'name' => 'copy_to_clipboard',
                                                              'offset' => '72',
                                                              'type' => '253'
                                                            }
                                                   },
                                         'Name' => 'struct ScreencopyFrames',
                                         'PrivateABI' => 1,
                                         'Size' => '56',
                                         'Source' => 'screenshot-manager.c',
                                         'Type' => 'Struct'
                                       },
                          '1633676' => {
                                         'BaseType' => '195',
                                         'Name' => 'char[64]',
                                         'Size' => '64',
                                         'Type' => 'Array'
                                       },
                          '1633692' => {
                                         'Line' => '82',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'child_watch_id',
                                                              'offset' => '0',
                                                              'type' => '277'
                                                            },
                                                     '1' => {
                                                              'name' => 'pid',
                                                              'offset' => '4',
                                                              'type' => '910469'
                                                            },
                                                     '2' => {
                                                              'name' => 'invocation',
                                                              'offset' => '8',
                                                              'type' => '6022'
                                                            },
                                                     '3' => {
                                                              'name' => 'stdout_',
                                                              'offset' => '22',
                                                              'type' => '1394796'
                                                            },
                                                     '4' => {
                                                              'name' => 'cancel',
                                                              'offset' => '36',
                                                              'type' => '4850'
                                                            },
                                                     '5' => {
                                                              'name' => 'read_buf',
                                                              'offset' => '50',
                                                              'type' => '1633676'
                                                            },
                                                     '6' => {
                                                              'name' => 'response',
                                                              'offset' => '150',
                                                              'type' => '1392379'
                                                            }
                                                   },
                                         'Name' => 'struct SlurpArea',
                                         'PrivateABI' => 1,
                                         'Size' => '104',
                                         'Source' => 'screenshot-manager.c',
                                         'Type' => 'Struct'
                                       },
                          '1633704' => {
                                         'Name' => 'struct zwlr_screencopy_manager_v1',
                                         'PrivateABI' => 1,
                                         'Type' => 'Struct'
                                       },
                          '1633709' => {
                                         'BaseType' => '1633704',
                                         'Name' => 'struct zwlr_screencopy_manager_v1*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1633714' => {
                                         'BaseType' => '1633564',
                                         'Name' => 'ScreencopyFrames*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1633719' => {
                                         'BaseType' => '1633692',
                                         'Name' => 'SlurpArea*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '164' => {
                                     'BaseType' => '53',
                                     'Header' => 'glibconfig.h',
                                     'Line' => '83',
                                     'Name' => 'gsize',
                                     'PrivateABI' => 1,
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '1841' => {
                                      'BaseType' => '650',
                                      'Name' => 'GData*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '1846' => {
                                      'BaseType' => '737',
                                      'Name' => 'GHashTable*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '1866' => {
                                      'BaseType' => '164',
                                      'Header' => 'gtype.h',
                                      'Line' => '427',
                                      'Name' => 'GType',
                                      'PrivateABI' => 1,
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '1879' => {
                                      'BaseType' => '1897',
                                      'Header' => 'gtype.h',
                                      'Line' => '431',
                                      'Name' => 'GValue',
                                      'PrivateABI' => 1,
                                      'Size' => '24',
                                      'Type' => 'Typedef'
                                    },
                          '188' => {
                                     'BaseType' => '1',
                                     'Name' => 'void*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '1897' => {
                                      'Header' => 'gvalue.h',
                                      'Line' => '131',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'g_type',
                                                           'offset' => '0',
                                                           'type' => '1866'
                                                         },
                                                  '1' => {
                                                           'name' => 'data',
                                                           'offset' => '8',
                                                           'type' => '2412'
                                                         }
                                                },
                                      'Name' => 'struct _GValue',
                                      'PrivateABI' => 1,
                                      'Size' => '24',
                                      'Type' => 'Struct'
                                    },
                          '190' => {
                                     'BaseType' => '195',
                                     'Name' => 'char*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '1937' => {
                                      'BaseType' => '1950',
                                      'Header' => 'gtype.h',
                                      'Line' => '434',
                                      'Name' => 'GTypeClass',
                                      'PrivateABI' => 1,
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '195' => {
                                     'Name' => 'char',
                                     'Size' => '1',
                                     'Type' => 'Intrinsic'
                                   },
                          '1950' => {
                                      'Header' => 'gtype.h',
                                      'Line' => '451',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'g_type',
                                                           'offset' => '0',
                                                           'type' => '1866'
                                                         }
                                                },
                                      'Name' => 'struct _GTypeClass',
                                      'PrivateABI' => 1,
                                      'Size' => '8',
                                      'Type' => 'Struct'
                                    },
                          '202' => {
                                     'BaseType' => '195',
                                     'Name' => 'char const',
                                     'Size' => '1',
                                     'Type' => 'Const'
                                   },
                          '2035' => {
                                      'BaseType' => '2048',
                                      'Header' => 'gtype.h',
                                      'Line' => '436',
                                      'Name' => 'GTypeInstance',
                                      'PrivateABI' => 1,
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '2040796' => {
                                         'Header' => 'gtkenums.h',
                                         'Line' => '197',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'GTK_ICON_SIZE_INVALID',
                                                              'value' => '0'
                                                            },
                                                     '1' => {
                                                              'name' => 'GTK_ICON_SIZE_MENU',
                                                              'value' => '1'
                                                            },
                                                     '2' => {
                                                              'name' => 'GTK_ICON_SIZE_SMALL_TOOLBAR',
                                                              'value' => '2'
                                                            },
                                                     '3' => {
                                                              'name' => 'GTK_ICON_SIZE_LARGE_TOOLBAR',
                                                              'value' => '3'
                                                            },
                                                     '4' => {
                                                              'name' => 'GTK_ICON_SIZE_BUTTON',
                                                              'value' => '4'
                                                            },
                                                     '5' => {
                                                              'name' => 'GTK_ICON_SIZE_DND',
                                                              'value' => '5'
                                                            },
                                                     '6' => {
                                                              'name' => 'GTK_ICON_SIZE_DIALOG',
                                                              'value' => '6'
                                                            }
                                                   },
                                         'Name' => 'enum GtkIconSize',
                                         'PrivateABI' => 1,
                                         'Size' => '4',
                                         'Type' => 'Enum'
                                       },
                          '2048' => {
                                      'Header' => 'gtype.h',
                                      'Line' => '461',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'g_class',
                                                           'offset' => '0',
                                                           'type' => '2152'
                                                         }
                                                },
                                      'Name' => 'struct _GTypeInstance',
                                      'PrivateABI' => 1,
                                      'Size' => '8',
                                      'Type' => 'Struct'
                                    },
                          '207' => {
                                     'BaseType' => '202',
                                     'Name' => 'char const*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '212' => {
                                     'BaseType' => '195',
                                     'Header' => 'gtypes.h',
                                     'Line' => '52',
                                     'Name' => 'gchar',
                                     'PrivateABI' => 1,
                                     'Size' => '1',
                                     'Type' => 'Typedef'
                                   },
                          '2152' => {
                                      'BaseType' => '1937',
                                      'Name' => 'GTypeClass*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '2155560' => {
                                         'BaseType' => '241',
                                         'Header' => 'gtypes.h',
                                         'Line' => '587',
                                         'Name' => 'gatomicrefcount',
                                         'PrivateABI' => 1,
                                         'Size' => '4',
                                         'Type' => 'Typedef'
                                       },
                          '2202240' => {
                                         'BaseType' => '2202252',
                                         'Header' => 'gtimer.h',
                                         'Line' => '42',
                                         'Name' => 'GTimer',
                                         'PrivateABI' => 1,
                                         'Type' => 'Typedef'
                                       },
                          '2202252' => {
                                         'Name' => 'struct _GTimer',
                                         'PrivateABI' => 1,
                                         'Type' => 'Struct'
                                       },
                          '2202257' => {
                                         'BaseType' => '2202240',
                                         'Name' => 'GTimer*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '229' => {
                                     'BaseType' => '46',
                                     'Header' => 'gtypes.h',
                                     'Line' => '54',
                                     'Name' => 'glong',
                                     'PrivateABI' => 1,
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '2293' => {
                                      'BaseType' => '1879',
                                      'Name' => 'GValue*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '2303' => {
                                      'Header' => 'gvalue.h',
                                      'Line' => '137',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'v_int',
                                                           'offset' => '0',
                                                           'type' => '241'
                                                         },
                                                  '1' => {
                                                           'name' => 'v_uint',
                                                           'offset' => '0',
                                                           'type' => '277'
                                                         },
                                                  '2' => {
                                                           'name' => 'v_long',
                                                           'offset' => '0',
                                                           'type' => '229'
                                                         },
                                                  '3' => {
                                                           'name' => 'v_ulong',
                                                           'offset' => '0',
                                                           'type' => '265'
                                                         },
                                                  '4' => {
                                                           'name' => 'v_int64',
                                                           'offset' => '0',
                                                           'type' => '140'
                                                         },
                                                  '5' => {
                                                           'name' => 'v_uint64',
                                                           'offset' => '0',
                                                           'type' => '152'
                                                         },
                                                  '6' => {
                                                           'name' => 'v_float',
                                                           'offset' => '0',
                                                           'type' => '289'
                                                         },
                                                  '7' => {
                                                           'name' => 'v_double',
                                                           'offset' => '0',
                                                           'type' => '308'
                                                         },
                                                  '8' => {
                                                           'name' => 'v_pointer',
                                                           'offset' => '0',
                                                           'type' => '327'
                                                         }
                                                },
                                      'Name' => 'anon-union-gvalue.h-137',
                                      'PrivateABI' => 1,
                                      'Size' => '8',
                                      'Type' => 'Union'
                                    },
                          '241' => {
                                     'BaseType' => '60',
                                     'Header' => 'gtypes.h',
                                     'Line' => '55',
                                     'Name' => 'gint',
                                     'PrivateABI' => 1,
                                     'Size' => '4',
                                     'Type' => 'Typedef'
                                   },
                          '241082' => {
                                        'BaseType' => '241095',
                                        'Header' => 'calls-dbus.h',
                                        'Line' => '374',
                                        'Name' => 'PhoshDBusObjectManagerClient',
                                        'PrivateABI' => 1,
                                        'Size' => '40',
                                        'Type' => 'Typedef'
                                      },
                          '241095' => {
                                        'Header' => 'calls-dbus.h',
                                        'Line' => '378',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'parent_instance',
                                                             'offset' => '0',
                                                             'type' => '5863'
                                                           },
                                                    '1' => {
                                                             'name' => 'priv',
                                                             'offset' => '50',
                                                             'type' => '241198'
                                                           }
                                                  },
                                        'Name' => 'struct _PhoshDBusObjectManagerClient',
                                        'PrivateABI' => 1,
                                        'Size' => '40',
                                        'Type' => 'Struct'
                                      },
                          '241180' => {
                                        'BaseType' => '241193',
                                        'Header' => 'calls-dbus.h',
                                        'Line' => '376',
                                        'Name' => 'PhoshDBusObjectManagerClientPrivate',
                                        'PrivateABI' => 1,
                                        'Type' => 'Typedef'
                                      },
                          '241193' => {
                                        'Name' => 'struct _PhoshDBusObjectManagerClientPrivate',
                                        'PrivateABI' => 1,
                                        'Type' => 'Struct'
                                      },
                          '241198' => {
                                        'BaseType' => '241180',
                                        'Name' => 'PhoshDBusObjectManagerClientPrivate*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '2412' => {
                                      'BaseType' => '2303',
                                      'Name' => 'anon-union-gvalue.h-137[2]',
                                      'Size' => '16',
                                      'Type' => 'Array'
                                    },
                          '241203' => {
                                        'BaseType' => '241082',
                                        'Name' => 'PhoshDBusObjectManagerClient*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '253' => {
                                     'BaseType' => '241',
                                     'Header' => 'gtypes.h',
                                     'Line' => '56',
                                     'Name' => 'gboolean',
                                     'PrivateABI' => 1,
                                     'Size' => '4',
                                     'Type' => 'Typedef'
                                   },
                          '265' => {
                                     'BaseType' => '53',
                                     'Header' => 'gtypes.h',
                                     'Line' => '60',
                                     'Name' => 'gulong',
                                     'PrivateABI' => 1,
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '277' => {
                                     'BaseType' => '133',
                                     'Header' => 'gtypes.h',
                                     'Line' => '61',
                                     'Name' => 'guint',
                                     'PrivateABI' => 1,
                                     'Size' => '4',
                                     'Type' => 'Typedef'
                                   },
                          '289' => {
                                     'BaseType' => '301',
                                     'Header' => 'gtypes.h',
                                     'Line' => '63',
                                     'Name' => 'gfloat',
                                     'PrivateABI' => 1,
                                     'Size' => '4',
                                     'Type' => 'Typedef'
                                   },
                          '2991339' => {
                                         'BaseType' => '1071186',
                                         'Name' => 'PhoshStatusPage*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '2991344' => {
                                         'BaseType' => '2991356',
                                         'Header' => 'quick-setting.h',
                                         'Line' => '16',
                                         'Name' => 'PhoshQuickSetting',
                                         'Size' => '48',
                                         'Type' => 'Typedef'
                                       },
                          '2991356' => {
                                         'Header' => 'quick-setting.h',
                                         'Line' => '16',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'parent_instance',
                                                              'offset' => '0',
                                                              'type' => '1172435'
                                                            }
                                                   },
                                         'Name' => 'struct _PhoshQuickSetting',
                                         'Size' => '48',
                                         'Type' => 'Struct'
                                       },
                          '2991562' => {
                                         'BaseType' => '2991344',
                                         'Name' => 'PhoshQuickSetting*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '301' => {
                                     'Name' => 'float',
                                     'Size' => '4',
                                     'Type' => 'Intrinsic'
                                   },
                          '308' => {
                                     'BaseType' => '320',
                                     'Header' => 'gtypes.h',
                                     'Line' => '64',
                                     'Name' => 'gdouble',
                                     'PrivateABI' => 1,
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '320' => {
                                     'Name' => 'double',
                                     'Size' => '8',
                                     'Type' => 'Intrinsic'
                                   },
                          '327' => {
                                     'BaseType' => '188',
                                     'Header' => 'gtypes.h',
                                     'Line' => '109',
                                     'Name' => 'gpointer',
                                     'PrivateABI' => 1,
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '3321' => {
                                      'BaseType' => '3333',
                                      'Header' => 'gobject.h',
                                      'Line' => '192',
                                      'Name' => 'GObject',
                                      'PrivateABI' => 1,
                                      'Size' => '24',
                                      'Type' => 'Typedef'
                                    },
                          '3333' => {
                                      'Header' => 'gobject.h',
                                      'Line' => '252',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'g_type_instance',
                                                           'offset' => '0',
                                                           'type' => '2035'
                                                         },
                                                  '1' => {
                                                           'name' => 'ref_count',
                                                           'offset' => '8',
                                                           'type' => '277'
                                                         },
                                                  '2' => {
                                                           'name' => 'qdata',
                                                           'offset' => '22',
                                                           'type' => '1841'
                                                         }
                                                },
                                      'Name' => 'struct _GObject',
                                      'PrivateABI' => 1,
                                      'Size' => '24',
                                      'Type' => 'Struct'
                                    },
                          '37359' => {
                                       'BaseType' => '485',
                                       'Name' => 'gchar**',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '406' => {
                                     'Name' => 'void(*)(gpointer)',
                                     'Param' => {
                                                  '0' => {
                                                           'type' => '327'
                                                         }
                                                },
                                     'Return' => '1',
                                     'Size' => '8',
                                     'Type' => 'FuncPtr'
                                   },
                          '46' => {
                                    'Name' => 'long',
                                    'Size' => '8',
                                    'Type' => 'Intrinsic'
                                  },
                          '4738' => {
                                      'BaseType' => '4750',
                                      'Header' => 'giotypes.h',
                                      'Line' => '40',
                                      'Name' => 'GCancellable',
                                      'PrivateABI' => 1,
                                      'Size' => '32',
                                      'Type' => 'Typedef'
                                    },
                          '4750' => {
                                      'Header' => 'gcancellable.h',
                                      'Line' => '44',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'parent_instance',
                                                           'offset' => '0',
                                                           'type' => '3321'
                                                         },
                                                  '1' => {
                                                           'name' => 'priv',
                                                           'offset' => '36',
                                                           'type' => '5953'
                                                         }
                                                },
                                      'Name' => 'struct _GCancellable',
                                      'PrivateABI' => 1,
                                      'Size' => '32',
                                      'Type' => 'Struct'
                                    },
                          '485' => {
                                     'BaseType' => '212',
                                     'Name' => 'gchar*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '4850' => {
                                      'BaseType' => '4738',
                                      'Name' => 'GCancellable*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '490' => {
                                     'BaseType' => '327',
                                     'Name' => 'gpointer*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '5002' => {
                                      'BaseType' => '5015',
                                      'Header' => 'giotypes.h',
                                      'Line' => '470',
                                      'Name' => 'GDBusMethodInvocation',
                                      'PrivateABI' => 1,
                                      'Type' => 'Typedef'
                                    },
                          '5015' => {
                                      'Name' => 'struct _GDBusMethodInvocation',
                                      'PrivateABI' => 1,
                                      'Type' => 'Struct'
                                    },
                          '53' => {
                                    'Name' => 'unsigned long',
                                    'Size' => '8',
                                    'Type' => 'Intrinsic'
                                  },
                          '5668' => {
                                      'BaseType' => '5681',
                                      'Header' => 'giotypes.h',
                                      'Line' => '516',
                                      'Name' => 'GDBusInterfaceSkeleton',
                                      'PrivateABI' => 1,
                                      'Size' => '32',
                                      'Type' => 'Typedef'
                                    },
                          '5681' => {
                                      'Header' => 'gdbusinterfaceskeleton.h',
                                      'Line' => '40',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'parent_instance',
                                                           'offset' => '0',
                                                           'type' => '3321'
                                                         },
                                                  '1' => {
                                                           'name' => 'priv',
                                                           'offset' => '36',
                                                           'type' => '6325'
                                                         }
                                                },
                                      'Name' => 'struct _GDBusInterfaceSkeleton',
                                      'PrivateABI' => 1,
                                      'Size' => '32',
                                      'Type' => 'Struct'
                                    },
                          '577' => {
                                     'Name' => 'void(*)()',
                                     'Return' => '1',
                                     'Size' => '8',
                                     'Type' => 'FuncPtr'
                                   },
                          '5863' => {
                                      'BaseType' => '5876',
                                      'Header' => 'giotypes.h',
                                      'Line' => '521',
                                      'Name' => 'GDBusObjectManagerClient',
                                      'PrivateABI' => 1,
                                      'Size' => '32',
                                      'Type' => 'Typedef'
                                    },
                          '5876' => {
                                      'Header' => 'gdbusobjectmanagerclient.h',
                                      'Line' => '40',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'parent_instance',
                                                           'offset' => '0',
                                                           'type' => '3321'
                                                         },
                                                  '1' => {
                                                           'name' => 'priv',
                                                           'offset' => '36',
                                                           'type' => '6781'
                                                         }
                                                },
                                      'Name' => 'struct _GDBusObjectManagerClient',
                                      'PrivateABI' => 1,
                                      'Size' => '32',
                                      'Type' => 'Struct'
                                    },
                          '590' => {
                                     'BaseType' => '602',
                                     'Header' => 'gthread.h',
                                     'Line' => '53',
                                     'Name' => 'GMutex',
                                     'PrivateABI' => 1,
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '5936' => {
                                      'BaseType' => '5948',
                                      'Header' => 'gcancellable.h',
                                      'Line' => '42',
                                      'Name' => 'GCancellablePrivate',
                                      'PrivateABI' => 1,
                                      'Type' => 'Typedef'
                                    },
                          '5948' => {
                                      'Name' => 'struct _GCancellablePrivate',
                                      'PrivateABI' => 1,
                                      'Type' => 'Struct'
                                    },
                          '5953' => {
                                      'BaseType' => '5936',
                                      'Name' => 'GCancellablePrivate*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '60' => {
                                    'Name' => 'int',
                                    'Size' => '4',
                                    'Type' => 'Intrinsic'
                                  },
                          '602' => {
                                     'Header' => 'gthread.h',
                                     'Line' => '60',
                                     'Memb' => {
                                                 '0' => {
                                                          'name' => 'p',
                                                          'offset' => '0',
                                                          'type' => '327'
                                                        },
                                                 '1' => {
                                                          'name' => 'i',
                                                          'offset' => '0',
                                                          'type' => '634'
                                                        }
                                               },
                                     'Name' => 'union _GMutex',
                                     'PrivateABI' => 1,
                                     'Size' => '8',
                                     'Type' => 'Union'
                                   },
                          '6022' => {
                                      'BaseType' => '5002',
                                      'Name' => 'GDBusMethodInvocation*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '6308' => {
                                      'BaseType' => '6320',
                                      'Header' => 'gdbusinterfaceskeleton.h',
                                      'Line' => '38',
                                      'Name' => 'GDBusInterfaceSkeletonPrivate',
                                      'PrivateABI' => 1,
                                      'Type' => 'Typedef'
                                    },
                          '6320' => {
                                      'Name' => 'struct _GDBusInterfaceSkeletonPrivate',
                                      'PrivateABI' => 1,
                                      'Type' => 'Struct'
                                    },
                          '6325' => {
                                      'BaseType' => '6308',
                                      'Name' => 'GDBusInterfaceSkeletonPrivate*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '634' => {
                                     'BaseType' => '277',
                                     'Name' => 'guint[2]',
                                     'Size' => '8',
                                     'Type' => 'Array'
                                   },
                          '650' => {
                                     'BaseType' => '662',
                                     'Header' => 'gdataset.h',
                                     'Line' => '38',
                                     'Name' => 'GData',
                                     'PrivateABI' => 1,
                                     'Type' => 'Typedef'
                                   },
                          '662' => {
                                     'Name' => 'struct _GData',
                                     'PrivateABI' => 1,
                                     'Type' => 'Struct'
                                   },
                          '667' => {
                                     'BaseType' => '679',
                                     'Header' => 'glist.h',
                                     'Line' => '39',
                                     'Name' => 'GList',
                                     'PrivateABI' => 1,
                                     'Size' => '24',
                                     'Type' => 'Typedef'
                                   },
                          '6764' => {
                                      'BaseType' => '6776',
                                      'Header' => 'gdbusobjectmanagerclient.h',
                                      'Line' => '38',
                                      'Name' => 'GDBusObjectManagerClientPrivate',
                                      'PrivateABI' => 1,
                                      'Type' => 'Typedef'
                                    },
                          '6776' => {
                                      'Name' => 'struct _GDBusObjectManagerClientPrivate',
                                      'PrivateABI' => 1,
                                      'Type' => 'Struct'
                                    },
                          '6781' => {
                                      'BaseType' => '6764',
                                      'Name' => 'GDBusObjectManagerClientPrivate*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '679' => {
                                     'Header' => 'glist.h',
                                     'Line' => '41',
                                     'Memb' => {
                                                 '0' => {
                                                          'name' => 'data',
                                                          'offset' => '0',
                                                          'type' => '327'
                                                        },
                                                 '1' => {
                                                          'name' => 'next',
                                                          'offset' => '8',
                                                          'type' => '732'
                                                        },
                                                 '2' => {
                                                          'name' => 'prev',
                                                          'offset' => '22',
                                                          'type' => '732'
                                                        }
                                               },
                                     'Name' => 'struct _GList',
                                     'PrivateABI' => 1,
                                     'Size' => '24',
                                     'Type' => 'Struct'
                                   },
                          '693750' => {
                                        'BaseType' => '60',
                                        'Header' => 'glibconfig.h',
                                        'Line' => '56',
                                        'Name' => 'gint32',
                                        'PrivateABI' => 1,
                                        'Size' => '4',
                                        'Type' => 'Typedef'
                                      },
                          '732' => {
                                     'BaseType' => '667',
                                     'Name' => 'GList*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '737' => {
                                     'BaseType' => '749',
                                     'Header' => 'ghash.h',
                                     'Line' => '40',
                                     'Name' => 'GHashTable',
                                     'PrivateABI' => 1,
                                     'Type' => 'Typedef'
                                   },
                          '749' => {
                                     'Name' => 'struct _GHashTable',
                                     'PrivateABI' => 1,
                                     'Type' => 'Struct'
                                   },
                          '754' => {
                                     'Name' => 'gboolean(*)(gpointer)',
                                     'Param' => {
                                                  '0' => {
                                                           'type' => '327'
                                                         }
                                                },
                                     'Return' => '253',
                                     'Size' => '8',
                                     'Type' => 'FuncPtr'
                                   },
                          '774' => {
                                     'BaseType' => '786',
                                     'Header' => 'gslist.h',
                                     'Line' => '39',
                                     'Name' => 'GSList',
                                     'PrivateABI' => 1,
                                     'Size' => '16',
                                     'Type' => 'Typedef'
                                   },
                          '786' => {
                                     'Header' => 'gslist.h',
                                     'Line' => '41',
                                     'Memb' => {
                                                 '0' => {
                                                          'name' => 'data',
                                                          'offset' => '0',
                                                          'type' => '327'
                                                        },
                                                 '1' => {
                                                          'name' => 'next',
                                                          'offset' => '8',
                                                          'type' => '826'
                                                        }
                                               },
                                     'Name' => 'struct _GSList',
                                     'PrivateABI' => 1,
                                     'Size' => '16',
                                     'Type' => 'Struct'
                                   },
                          '801922' => {
                                        'BaseType' => '801935',
                                        'Header' => 'phosh-screenshot-dbus.h',
                                        'Line' => '358',
                                        'Name' => 'PhoshDBusScreenshotSkeleton',
                                        'PrivateABI' => 1,
                                        'Size' => '40',
                                        'Type' => 'Typedef'
                                      },
                          '801935' => {
                                        'Header' => 'phosh-screenshot-dbus.h',
                                        'Line' => '362',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'parent_instance',
                                                             'offset' => '0',
                                                             'type' => '5668'
                                                           },
                                                    '1' => {
                                                             'name' => 'priv',
                                                             'offset' => '50',
                                                             'type' => '802117'
                                                           }
                                                  },
                                        'Name' => 'struct _PhoshDBusScreenshotSkeleton',
                                        'PrivateABI' => 1,
                                        'Size' => '40',
                                        'Type' => 'Struct'
                                      },
                          '802019' => {
                                        'BaseType' => '802032',
                                        'Header' => 'phosh-screenshot-dbus.h',
                                        'Line' => '360',
                                        'Name' => 'PhoshDBusScreenshotSkeletonPrivate',
                                        'PrivateABI' => 1,
                                        'Size' => '40',
                                        'Type' => 'Typedef'
                                      },
                          '802032' => {
                                        'Line' => '2453',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'properties',
                                                             'offset' => '0',
                                                             'type' => '2293'
                                                           },
                                                    '1' => {
                                                             'name' => 'changed_properties',
                                                             'offset' => '8',
                                                             'type' => '732'
                                                           },
                                                    '2' => {
                                                             'name' => 'changed_properties_idle_source',
                                                             'offset' => '22',
                                                             'type' => '1287'
                                                           },
                                                    '3' => {
                                                             'name' => 'context',
                                                             'offset' => '36',
                                                             'type' => '1302'
                                                           },
                                                    '4' => {
                                                             'name' => 'lock',
                                                             'offset' => '50',
                                                             'type' => '590'
                                                           }
                                                  },
                                        'Name' => 'struct _PhoshDBusScreenshotSkeletonPrivate',
                                        'PrivateABI' => 1,
                                        'Size' => '40',
                                        'Source' => 'phosh-screenshot-dbus.c',
                                        'Type' => 'Struct'
                                      },
                          '802117' => {
                                        'BaseType' => '802019',
                                        'Name' => 'PhoshDBusScreenshotSkeletonPrivate*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '826' => {
                                     'BaseType' => '774',
                                     'Name' => 'GSList*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '831' => {
                                     'BaseType' => '843',
                                     'Header' => 'gmain.h',
                                     'Line' => '70',
                                     'Name' => 'GMainContext',
                                     'PrivateABI' => 1,
                                     'Type' => 'Typedef'
                                   },
                          '843' => {
                                     'Name' => 'struct _GMainContext',
                                     'PrivateABI' => 1,
                                     'Type' => 'Struct'
                                   },
                          '848' => {
                                     'BaseType' => '860',
                                     'Header' => 'gmain.h',
                                     'Line' => '86',
                                     'Name' => 'GSource',
                                     'PrivateABI' => 1,
                                     'Size' => '96',
                                     'Type' => 'Typedef'
                                   },
                          '860' => {
                                     'Header' => 'gmain.h',
                                     'Line' => '267',
                                     'Memb' => {
                                                 '0' => {
                                                          'name' => 'callback_data',
                                                          'offset' => '0',
                                                          'type' => '327'
                                                        },
                                                 '1' => {
                                                          'name' => 'callback_funcs',
                                                          'offset' => '8',
                                                          'type' => '1292'
                                                        },
                                                 '10' => {
                                                           'name' => 'next',
                                                           'offset' => '114',
                                                           'type' => '1287'
                                                         },
                                                 '11' => {
                                                           'name' => 'name',
                                                           'offset' => '128',
                                                           'type' => '190'
                                                         },
                                                 '12' => {
                                                           'name' => 'priv',
                                                           'offset' => '136',
                                                           'type' => '1307'
                                                         },
                                                 '2' => {
                                                          'name' => 'source_funcs',
                                                          'offset' => '22',
                                                          'type' => '1297'
                                                        },
                                                 '3' => {
                                                          'name' => 'ref_count',
                                                          'offset' => '36',
                                                          'type' => '277'
                                                        },
                                                 '4' => {
                                                          'name' => 'context',
                                                          'offset' => '50',
                                                          'type' => '1302'
                                                        },
                                                 '5' => {
                                                          'name' => 'priority',
                                                          'offset' => '64',
                                                          'type' => '241'
                                                        },
                                                 '6' => {
                                                          'name' => 'flags',
                                                          'offset' => '68',
                                                          'type' => '277'
                                                        },
                                                 '7' => {
                                                          'name' => 'source_id',
                                                          'offset' => '72',
                                                          'type' => '277'
                                                        },
                                                 '8' => {
                                                          'name' => 'poll_fds',
                                                          'offset' => '86',
                                                          'type' => '826'
                                                        },
                                                 '9' => {
                                                          'name' => 'prev',
                                                          'offset' => '100',
                                                          'type' => '1287'
                                                        }
                                               },
                                     'Name' => 'struct _GSource',
                                     'PrivateABI' => 1,
                                     'Size' => '96',
                                     'Type' => 'Struct'
                                   },
                          '910469' => {
                                        'BaseType' => '60',
                                        'Header' => 'glibconfig.h',
                                        'Line' => '201',
                                        'Name' => 'GPid',
                                        'PrivateABI' => 1,
                                        'Size' => '4',
                                        'Type' => 'Typedef'
                                      },
                          '915101' => {
                                        'BaseType' => '915113',
                                        'Header' => 'shell.h',
                                        'Line' => '20',
                                        'Name' => 'PhoshShell',
                                        'Size' => '24',
                                        'Type' => 'Typedef'
                                      },
                          '915113' => {
                                        'Header' => 'shell.h',
                                        'Line' => '20',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'parent_instance',
                                                             'offset' => '0',
                                                             'type' => '3321'
                                                           }
                                                  },
                                        'Name' => 'struct _PhoshShell',
                                        'Size' => '24',
                                        'Type' => 'Struct'
                                      },
                          '915140' => {
                                        'BaseType' => '915101',
                                        'Name' => 'PhoshShell*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '932748' => {
                                        'BaseType' => '932760',
                                        'Header' => 'garray.h',
                                        'Line' => '39',
                                        'Name' => 'GArray',
                                        'PrivateABI' => 1,
                                        'Size' => '16',
                                        'Type' => 'Typedef'
                                      },
                          '932760' => {
                                        'Header' => 'garray.h',
                                        'Line' => '43',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'data',
                                                             'offset' => '0',
                                                             'type' => '485'
                                                           },
                                                    '1' => {
                                                             'name' => 'len',
                                                             'offset' => '8',
                                                             'type' => '277'
                                                           }
                                                  },
                                        'Name' => 'struct _GArray',
                                        'PrivateABI' => 1,
                                        'Size' => '16',
                                        'Type' => 'Struct'
                                      },
                          '932800' => {
                                        'BaseType' => '932812',
                                        'Header' => 'garray.h',
                                        'Line' => '41',
                                        'Name' => 'GPtrArray',
                                        'PrivateABI' => 1,
                                        'Size' => '16',
                                        'Type' => 'Typedef'
                                      },
                          '932812' => {
                                        'Header' => 'garray.h',
                                        'Line' => '55',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'pdata',
                                                             'offset' => '0',
                                                             'type' => '490'
                                                           },
                                                    '1' => {
                                                             'name' => 'len',
                                                             'offset' => '8',
                                                             'type' => '277'
                                                           }
                                                  },
                                        'Name' => 'struct _GPtrArray',
                                        'PrivateABI' => 1,
                                        'Size' => '16',
                                        'Type' => 'Struct'
                                      },
                          '933212' => {
                                        'BaseType' => '932748',
                                        'Name' => 'GArray*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '933217' => {
                                        'BaseType' => '932800',
                                        'Name' => 'GPtrArray*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '934218' => {
                                        'BaseType' => '3333',
                                        'Header' => 'gobject.h',
                                        'Line' => '194',
                                        'Name' => 'GInitiallyUnowned',
                                        'PrivateABI' => 1,
                                        'Size' => '24',
                                        'Type' => 'Typedef'
                                      },
                          '934867' => {
                                        'Header' => 'cairo.h',
                                        'Line' => '532',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'x',
                                                             'offset' => '0',
                                                             'type' => '60'
                                                           },
                                                    '1' => {
                                                             'name' => 'y',
                                                             'offset' => '4',
                                                             'type' => '60'
                                                           },
                                                    '2' => {
                                                             'name' => 'width',
                                                             'offset' => '8',
                                                             'type' => '60'
                                                           },
                                                    '3' => {
                                                             'name' => 'height',
                                                             'offset' => '18',
                                                             'type' => '60'
                                                           }
                                                  },
                                        'Name' => 'struct _cairo_rectangle_int',
                                        'PrivateABI' => 1,
                                        'Size' => '16',
                                        'Type' => 'Struct'
                                      },
                          '934934' => {
                                        'BaseType' => '934867',
                                        'Header' => 'cairo.h',
                                        'Line' => '535',
                                        'Name' => 'cairo_rectangle_int_t',
                                        'PrivateABI' => 1,
                                        'Size' => '16',
                                        'Type' => 'Typedef'
                                      },
                          '935031' => {
                                        'BaseType' => '934934',
                                        'Header' => 'gdktypes.h',
                                        'Line' => '93',
                                        'Name' => 'GdkRectangle',
                                        'PrivateABI' => 1,
                                        'Size' => '16',
                                        'Type' => 'Typedef'
                                      },
                          '941062' => {
                                        'BaseType' => '941074',
                                        'Header' => 'gtktypes.h',
                                        'Line' => '46',
                                        'Name' => 'GtkWidget',
                                        'PrivateABI' => 1,
                                        'Size' => '32',
                                        'Type' => 'Typedef'
                                      },
                          '941074' => {
                                        'Header' => 'gtkwidget.h',
                                        'Line' => '133',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'parent_instance',
                                                             'offset' => '0',
                                                             'type' => '934218'
                                                           },
                                                    '1' => {
                                                             'name' => 'priv',
                                                             'offset' => '36',
                                                             'type' => '943527'
                                                           }
                                                  },
                                        'Name' => 'struct _GtkWidget',
                                        'PrivateABI' => 1,
                                        'Size' => '32',
                                        'Type' => 'Struct'
                                      },
                          '942230' => {
                                        'BaseType' => '942242',
                                        'Header' => 'gtkwidget.h',
                                        'Line' => '66',
                                        'Name' => 'GtkWidgetPrivate',
                                        'PrivateABI' => 1,
                                        'Type' => 'Typedef'
                                      },
                          '942242' => {
                                        'Name' => 'struct _GtkWidgetPrivate',
                                        'PrivateABI' => 1,
                                        'Type' => 'Struct'
                                      },
                          '943522' => {
                                        'BaseType' => '941062',
                                        'Name' => 'GtkWidget*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '943527' => {
                                        'BaseType' => '942230',
                                        'Name' => 'GtkWidgetPrivate*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '960124' => {
                                        'BaseType' => '960136',
                                        'Header' => 'giotypes.h',
                                        'Line' => '62',
                                        'Name' => 'GSettings',
                                        'PrivateABI' => 1,
                                        'Size' => '32',
                                        'Type' => 'Typedef'
                                      },
                          '960136' => {
                                        'Header' => 'gsettings.h',
                                        'Line' => '65',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'parent_instance',
                                                             'offset' => '0',
                                                             'type' => '3321'
                                                           },
                                                    '1' => {
                                                             'name' => 'priv',
                                                             'offset' => '36',
                                                             'type' => '960401'
                                                           }
                                                  },
                                        'Name' => 'struct _GSettings',
                                        'PrivateABI' => 1,
                                        'Size' => '32',
                                        'Type' => 'Struct'
                                      },
                          '960176' => {
                                        'BaseType' => '960188',
                                        'Header' => 'giotypes.h',
                                        'Line' => '70',
                                        'Name' => 'GFileMonitor',
                                        'PrivateABI' => 1,
                                        'Size' => '32',
                                        'Type' => 'Typedef'
                                      },
                          '960188' => {
                                        'Header' => 'gfilemonitor.h',
                                        'Line' => '44',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'parent_instance',
                                                             'offset' => '0',
                                                             'type' => '3321'
                                                           },
                                                    '1' => {
                                                             'name' => 'priv',
                                                             'offset' => '36',
                                                             'type' => '960374'
                                                           }
                                                  },
                                        'Name' => 'struct _GFileMonitor',
                                        'PrivateABI' => 1,
                                        'Size' => '32',
                                        'Type' => 'Struct'
                                      },
                          '960228' => {
                                        'BaseType' => '960240',
                                        'Header' => 'giotypes.h',
                                        'Line' => '74',
                                        'Name' => 'GFile',
                                        'PrivateABI' => 1,
                                        'Type' => 'Typedef'
                                      },
                          '960240' => {
                                        'Name' => 'struct _GFile',
                                        'PrivateABI' => 1,
                                        'Type' => 'Struct'
                                      },
                          '960325' => {
                                        'BaseType' => '960228',
                                        'Name' => 'GFile*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '960352' => {
                                        'BaseType' => '960176',
                                        'Name' => 'GFileMonitor*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '960357' => {
                                        'BaseType' => '960369',
                                        'Header' => 'gfilemonitor.h',
                                        'Line' => '42',
                                        'Name' => 'GFileMonitorPrivate',
                                        'PrivateABI' => 1,
                                        'Type' => 'Typedef'
                                      },
                          '960369' => {
                                        'Name' => 'struct _GFileMonitorPrivate',
                                        'PrivateABI' => 1,
                                        'Type' => 'Struct'
                                      },
                          '960374' => {
                                        'BaseType' => '960357',
                                        'Name' => 'GFileMonitorPrivate*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '960379' => {
                                        'BaseType' => '960391',
                                        'Header' => 'gsettings.h',
                                        'Line' => '44',
                                        'Name' => 'GSettingsPrivate',
                                        'PrivateABI' => 1,
                                        'Type' => 'Typedef'
                                      },
                          '960391' => {
                                        'Name' => 'struct _GSettingsPrivate',
                                        'PrivateABI' => 1,
                                        'Type' => 'Struct'
                                      },
                          '960396' => {
                                        'BaseType' => '960124',
                                        'Name' => 'GSettings*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '960401' => {
                                        'BaseType' => '960379',
                                        'Name' => 'GSettingsPrivate*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '960667' => {
                                        'BaseType' => '960679',
                                        'Header' => 'gtktypes.h',
                                        'Line' => '48',
                                        'Name' => 'GtkWindow',
                                        'PrivateABI' => 1,
                                        'Size' => '56',
                                        'Type' => 'Typedef'
                                      },
                          '960679' => {
                                        'Header' => 'gtkwindow.h',
                                        'Line' => '53',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'bin',
                                                             'offset' => '0',
                                                             'type' => '960820'
                                                           },
                                                    '1' => {
                                                             'name' => 'priv',
                                                             'offset' => '72',
                                                             'type' => '960911'
                                                           }
                                                  },
                                        'Name' => 'struct _GtkWindow',
                                        'PrivateABI' => 1,
                                        'Size' => '56',
                                        'Type' => 'Struct'
                                      },
                          '960746' => {
                                        'BaseType' => '960758',
                                        'Header' => 'gtkcontainer.h',
                                        'Line' => '45',
                                        'Name' => 'GtkContainer',
                                        'PrivateABI' => 1,
                                        'Size' => '40',
                                        'Type' => 'Typedef'
                                      },
                          '960758' => {
                                        'Header' => 'gtkcontainer.h',
                                        'Line' => '49',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'widget',
                                                             'offset' => '0',
                                                             'type' => '941062'
                                                           },
                                                    '1' => {
                                                             'name' => 'priv',
                                                             'offset' => '50',
                                                             'type' => '960815'
                                                           }
                                                  },
                                        'Name' => 'struct _GtkContainer',
                                        'PrivateABI' => 1,
                                        'Size' => '40',
                                        'Type' => 'Struct'
                                      },
                          '960798' => {
                                        'BaseType' => '960810',
                                        'Header' => 'gtkcontainer.h',
                                        'Line' => '46',
                                        'Name' => 'GtkContainerPrivate',
                                        'PrivateABI' => 1,
                                        'Type' => 'Typedef'
                                      },
                          '960810' => {
                                        'Name' => 'struct _GtkContainerPrivate',
                                        'PrivateABI' => 1,
                                        'Type' => 'Struct'
                                      },
                          '960815' => {
                                        'BaseType' => '960798',
                                        'Name' => 'GtkContainerPrivate*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '960820' => {
                                        'BaseType' => '960832',
                                        'Header' => 'gtkbin.h',
                                        'Line' => '45',
                                        'Name' => 'GtkBin',
                                        'PrivateABI' => 1,
                                        'Size' => '48',
                                        'Type' => 'Typedef'
                                      },
                          '960832' => {
                                        'Header' => 'gtkbin.h',
                                        'Line' => '49',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'container',
                                                             'offset' => '0',
                                                             'type' => '960746'
                                                           },
                                                    '1' => {
                                                             'name' => 'priv',
                                                             'offset' => '64',
                                                             'type' => '960889'
                                                           }
                                                  },
                                        'Name' => 'struct _GtkBin',
                                        'PrivateABI' => 1,
                                        'Size' => '48',
                                        'Type' => 'Struct'
                                      },
                          '960872' => {
                                        'BaseType' => '960884',
                                        'Header' => 'gtkbin.h',
                                        'Line' => '46',
                                        'Name' => 'GtkBinPrivate',
                                        'PrivateABI' => 1,
                                        'Type' => 'Typedef'
                                      },
                          '960884' => {
                                        'Name' => 'struct _GtkBinPrivate',
                                        'PrivateABI' => 1,
                                        'Type' => 'Struct'
                                      },
                          '960889' => {
                                        'BaseType' => '960872',
                                        'Name' => 'GtkBinPrivate*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '960894' => {
                                        'BaseType' => '960906',
                                        'Header' => 'gtkwindow.h',
                                        'Line' => '46',
                                        'Name' => 'GtkWindowPrivate',
                                        'PrivateABI' => 1,
                                        'Type' => 'Typedef'
                                      },
                          '960906' => {
                                        'Name' => 'struct _GtkWindowPrivate',
                                        'PrivateABI' => 1,
                                        'Type' => 'Struct'
                                      },
                          '960911' => {
                                        'BaseType' => '960894',
                                        'Name' => 'GtkWindowPrivate*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '960916' => {
                                        'BaseType' => '960928',
                                        'Header' => 'layersurface.h',
                                        'Line' => '15',
                                        'Name' => 'PhoshLayerSurface',
                                        'Size' => '56',
                                        'Type' => 'Typedef'
                                      },
                          '960928' => {
                                        'Header' => 'layersurface.h',
                                        'Line' => '15',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'parent_instance',
                                                             'offset' => '0',
                                                             'type' => '960667'
                                                           }
                                                  },
                                        'Name' => 'struct _PhoshLayerSurface',
                                        'Size' => '56',
                                        'Type' => 'Struct'
                                      },
                          '960960' => {
                                        'BaseType' => '960965',
                                        'Name' => 'struct wl_output*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '960965' => {
                                        'Name' => 'struct wl_output',
                                        'PrivateABI' => 1,
                                        'Type' => 'Struct'
                                      },
                          '961011' => {
                                        'BaseType' => '961016',
                                        'Name' => 'struct zwlr_gamma_control_v1*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '961016' => {
                                        'Name' => 'struct zwlr_gamma_control_v1',
                                        'PrivateABI' => 1,
                                        'Type' => 'Struct'
                                      },
                          '961021' => {
                                        'BaseType' => '961026',
                                        'Name' => 'struct zwlr_output_power_v1*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '961026' => {
                                        'Name' => 'struct zwlr_output_power_v1',
                                        'PrivateABI' => 1,
                                        'Type' => 'Struct'
                                      },
                          '961031' => {
                                        'BaseType' => '961036',
                                        'Name' => 'struct zxdg_output_v1*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '961036' => {
                                        'Name' => 'struct zxdg_output_v1',
                                        'PrivateABI' => 1,
                                        'Type' => 'Struct'
                                      },
                          '961063' => {
                                        'BaseType' => '961075',
                                        'Header' => 'backlight.h',
                                        'Line' => '21',
                                        'Name' => 'PhoshBacklight',
                                        'PrivateABI' => 1,
                                        'Size' => '24',
                                        'Type' => 'Typedef'
                                      },
                          '961075' => {
                                        'Header' => 'backlight.h',
                                        'Line' => '21',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'parent_instance',
                                                             'offset' => '0',
                                                             'type' => '3321'
                                                           }
                                                  },
                                        'Name' => 'struct _PhoshBacklight',
                                        'PrivateABI' => 1,
                                        'Size' => '24',
                                        'Type' => 'Struct'
                                      },
                          '961102' => {
                                        'BaseType' => '961063',
                                        'Name' => 'PhoshBacklight*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '961107' => {
                                        'Header' => 'monitor.h',
                                        'Line' => '42',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'PHOSH_MONITOR_CONNECTOR_TYPE_Unknown',
                                                             'value' => '0'
                                                           },
                                                    '1' => {
                                                             'name' => 'PHOSH_MONITOR_CONNECTOR_TYPE_VGA',
                                                             'value' => '1'
                                                           },
                                                    '10' => {
                                                              'name' => 'PHOSH_MONITOR_CONNECTOR_TYPE_DisplayPort',
                                                              'value' => '10'
                                                            },
                                                    '11' => {
                                                              'name' => 'PHOSH_MONITOR_CONNECTOR_TYPE_HDMIA',
                                                              'value' => '11'
                                                            },
                                                    '12' => {
                                                              'name' => 'PHOSH_MONITOR_CONNECTOR_TYPE_HDMIB',
                                                              'value' => '12'
                                                            },
                                                    '13' => {
                                                              'name' => 'PHOSH_MONITOR_CONNECTOR_TYPE_TV',
                                                              'value' => '13'
                                                            },
                                                    '14' => {
                                                              'name' => 'PHOSH_MONITOR_CONNECTOR_TYPE_eDP',
                                                              'value' => '14'
                                                            },
                                                    '15' => {
                                                              'name' => 'PHOSH_MONITOR_CONNECTOR_TYPE_VIRTUAL',
                                                              'value' => '15'
                                                            },
                                                    '16' => {
                                                              'name' => 'PHOSH_MONITOR_CONNECTOR_TYPE_DSI',
                                                              'value' => '16'
                                                            },
                                                    '2' => {
                                                             'name' => 'PHOSH_MONITOR_CONNECTOR_TYPE_DVII',
                                                             'value' => '2'
                                                           },
                                                    '3' => {
                                                             'name' => 'PHOSH_MONITOR_CONNECTOR_TYPE_DVID',
                                                             'value' => '3'
                                                           },
                                                    '4' => {
                                                             'name' => 'PHOSH_MONITOR_CONNECTOR_TYPE_DVIA',
                                                             'value' => '4'
                                                           },
                                                    '5' => {
                                                             'name' => 'PHOSH_MONITOR_CONNECTOR_TYPE_Composite',
                                                             'value' => '5'
                                                           },
                                                    '6' => {
                                                             'name' => 'PHOSH_MONITOR_CONNECTOR_TYPE_SVIDEO',
                                                             'value' => '6'
                                                           },
                                                    '7' => {
                                                             'name' => 'PHOSH_MONITOR_CONNECTOR_TYPE_LVDS',
                                                             'value' => '7'
                                                           },
                                                    '8' => {
                                                             'name' => 'PHOSH_MONITOR_CONNECTOR_TYPE_Component',
                                                             'value' => '8'
                                                           },
                                                    '9' => {
                                                             'name' => 'PHOSH_MONITOR_CONNECTOR_TYPE_9PinDIN',
                                                             'value' => '9'
                                                           }
                                                  },
                                        'Name' => 'enum _PhoshMonitorConnectorType',
                                        'PrivateABI' => 1,
                                        'Size' => '4',
                                        'Type' => 'Enum'
                                      },
                          '961226' => {
                                        'BaseType' => '961107',
                                        'Header' => 'monitor.h',
                                        'Line' => '61',
                                        'Name' => 'PhoshMonitorConnectorType',
                                        'PrivateABI' => 1,
                                        'Size' => '4',
                                        'Type' => 'Typedef'
                                      },
                          '961238' => {
                                        'Header' => 'monitor.h',
                                        'Line' => '104',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'PHOSH_MONITOR_POWER_SAVE_MODE_OFF',
                                                             'value' => '0'
                                                           },
                                                    '1' => {
                                                             'name' => 'PHOSH_MONITOR_POWER_SAVE_MODE_ON',
                                                             'value' => '1'
                                                           }
                                                  },
                                        'Name' => 'enum _PhoshMonitorPowerSaveMode',
                                        'PrivateABI' => 1,
                                        'Size' => '4',
                                        'Type' => 'Enum'
                                      },
                          '961267' => {
                                        'BaseType' => '961238',
                                        'Header' => 'monitor.h',
                                        'Line' => '107',
                                        'Name' => 'PhoshMonitorPowerSaveMode',
                                        'PrivateABI' => 1,
                                        'Size' => '4',
                                        'Type' => 'Typedef'
                                      },
                          '961279' => {
                                        'Header' => 'monitor.h',
                                        'Line' => '123',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'x',
                                                             'offset' => '0',
                                                             'type' => '693750'
                                                           },
                                                    '1' => {
                                                             'name' => 'y',
                                                             'offset' => '4',
                                                             'type' => '693750'
                                                           },
                                                    '2' => {
                                                             'name' => 'width',
                                                             'offset' => '8',
                                                             'type' => '693750'
                                                           },
                                                    '3' => {
                                                             'name' => 'height',
                                                             'offset' => '18',
                                                             'type' => '693750'
                                                           }
                                                  },
                                        'Name' => 'struct PhoshLogicalSize',
                                        'PrivateABI' => 1,
                                        'Size' => '16',
                                        'Type' => 'Struct'
                                      },
                          '961341' => {
                                        'Header' => 'monitor.h',
                                        'Line' => '111',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'parent',
                                                             'offset' => '0',
                                                             'type' => '3321'
                                                           },
                                                    '1' => {
                                                             'name' => 'wl_output',
                                                             'offset' => '36',
                                                             'type' => '960960'
                                                           },
                                                    '10' => {
                                                              'name' => 'transform',
                                                              'offset' => '114',
                                                              'type' => '693750'
                                                            },
                                                    '11' => {
                                                              'name' => 'logical',
                                                              'offset' => '118',
                                                              'type' => '961279'
                                                            },
                                                    '12' => {
                                                              'name' => 'width_mm',
                                                              'offset' => '146',
                                                              'type' => '60'
                                                            },
                                                    '13' => {
                                                              'name' => 'height_mm',
                                                              'offset' => '150',
                                                              'type' => '60'
                                                            },
                                                    '14' => {
                                                              'name' => 'description',
                                                              'offset' => '260',
                                                              'type' => '190'
                                                            },
                                                    '15' => {
                                                              'name' => 'modes',
                                                              'offset' => '274',
                                                              'type' => '933212'
                                                            },
                                                    '16' => {
                                                              'name' => 'current_mode',
                                                              'offset' => '288',
                                                              'type' => '277'
                                                            },
                                                    '17' => {
                                                              'name' => 'preferred_mode',
                                                              'offset' => '292',
                                                              'type' => '277'
                                                            },
                                                    '18' => {
                                                              'name' => 'name',
                                                              'offset' => '296',
                                                              'type' => '190'
                                                            },
                                                    '19' => {
                                                              'name' => 'conn_type',
                                                              'offset' => '310',
                                                              'type' => '961226'
                                                            },
                                                    '2' => {
                                                             'name' => 'xdg_output',
                                                             'offset' => '50',
                                                             'type' => '961031'
                                                           },
                                                    '20' => {
                                                              'name' => 'wl_output_done',
                                                              'offset' => '320',
                                                              'type' => '253'
                                                            },
                                                    '21' => {
                                                              'name' => 'gamma_control',
                                                              'offset' => '324',
                                                              'type' => '961011'
                                                            },
                                                    '22' => {
                                                              'name' => 'n_gamma_entries',
                                                              'offset' => '338',
                                                              'type' => '121'
                                                            },
                                                    '23' => {
                                                              'name' => 'backlight',
                                                              'offset' => '352',
                                                              'type' => '961102'
                                                            },
                                                    '3' => {
                                                             'name' => 'wlr_output_power',
                                                             'offset' => '64',
                                                             'type' => '961021'
                                                           },
                                                    '4' => {
                                                             'name' => 'power_mode',
                                                             'offset' => '72',
                                                             'type' => '961267'
                                                           },
                                                    '5' => {
                                                             'name' => 'x',
                                                             'offset' => '82',
                                                             'type' => '60'
                                                           },
                                                    '6' => {
                                                             'name' => 'y',
                                                             'offset' => '86',
                                                             'type' => '60'
                                                           },
                                                    '7' => {
                                                             'name' => 'width',
                                                             'offset' => '96',
                                                             'type' => '60'
                                                           },
                                                    '8' => {
                                                             'name' => 'height',
                                                             'offset' => '100',
                                                             'type' => '60'
                                                           },
                                                    '9' => {
                                                             'name' => 'subpixel',
                                                             'offset' => '104',
                                                             'type' => '60'
                                                           }
                                                  },
                                        'Name' => 'struct _PhoshMonitor',
                                        'PrivateABI' => 1,
                                        'Size' => '168',
                                        'Type' => 'Struct'
                                      },
                          '961663' => {
                                        'BaseType' => '961341',
                                        'Header' => 'monitor.h',
                                        'Line' => '147',
                                        'Name' => 'PhoshMonitor',
                                        'PrivateABI' => 1,
                                        'Size' => '168',
                                        'Type' => 'Typedef'
                                      },
                          '961675' => {
                                        'BaseType' => '961663',
                                        'Name' => 'PhoshMonitor*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '961736' => {
                                        'Header' => 'gdesktop-enums.h',
                                        'Line' => '56',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'G_DESKTOP_BACKGROUND_STYLE_NONE',
                                                             'value' => '0'
                                                           },
                                                    '1' => {
                                                             'name' => 'G_DESKTOP_BACKGROUND_STYLE_WALLPAPER',
                                                             'value' => '1'
                                                           },
                                                    '2' => {
                                                             'name' => 'G_DESKTOP_BACKGROUND_STYLE_CENTERED',
                                                             'value' => '2'
                                                           },
                                                    '3' => {
                                                             'name' => 'G_DESKTOP_BACKGROUND_STYLE_SCALED',
                                                             'value' => '3'
                                                           },
                                                    '4' => {
                                                             'name' => 'G_DESKTOP_BACKGROUND_STYLE_STRETCHED',
                                                             'value' => '4'
                                                           },
                                                    '5' => {
                                                             'name' => 'G_DESKTOP_BACKGROUND_STYLE_ZOOM',
                                                             'value' => '5'
                                                           },
                                                    '6' => {
                                                             'name' => 'G_DESKTOP_BACKGROUND_STYLE_SPANNED',
                                                             'value' => '6'
                                                           }
                                                  },
                                        'Name' => 'enum GDesktopBackgroundStyle',
                                        'PrivateABI' => 1,
                                        'Size' => '4',
                                        'Type' => 'Enum'
                                      },
                          '961897' => {
                                        'BaseType' => '961909',
                                        'Header' => 'manager.h',
                                        'Line' => '15',
                                        'Name' => 'PhoshManager',
                                        'PrivateABI' => 1,
                                        'Size' => '24',
                                        'Type' => 'Typedef'
                                      },
                          '961909' => {
                                        'Header' => 'manager.h',
                                        'Line' => '15',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'parent_instance',
                                                             'offset' => '0',
                                                             'type' => '3321'
                                                           }
                                                  },
                                        'Name' => 'struct _PhoshManager',
                                        'PrivateABI' => 1,
                                        'Size' => '24',
                                        'Type' => 'Struct'
                                      },
                          '991525' => {
                                        'BaseType' => '991537',
                                        'Header' => 'status-icon.h',
                                        'Line' => '15',
                                        'Name' => 'PhoshStatusIcon',
                                        'Size' => '48',
                                        'Type' => 'Typedef'
                                      },
                          '991537' => {
                                        'Header' => 'status-icon.h',
                                        'Line' => '15',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'parent_instance',
                                                             'offset' => '0',
                                                             'type' => '960820'
                                                           }
                                                  },
                                        'Name' => 'struct _PhoshStatusIcon',
                                        'Size' => '48',
                                        'Type' => 'Struct'
                                      },
                          '991743' => {
                                        'BaseType' => '991525',
                                        'Name' => 'PhoshStatusIcon*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      }
                        },
          'UndefinedSymbols' => {
                                  'libphosh-0.45.so.0' => {
                                                            '_ITM_deregisterTMCloneTable' => 0,
                                                            '_ITM_registerTMCloneTable' => 0,
                                                            '__cxa_finalize@GLIBC_2.2.5' => 0,
                                                            '__errno_location@GLIBC_2.2.5' => 0,
                                                            '__gmon_start__' => 0,
                                                            '__stack_chk_fail@GLIBC_2.4' => 0,
                                                            'as_component_box_index_safe' => 0,
                                                            'as_component_box_is_empty' => 0,
                                                            'as_component_get_data_id' => 0,
                                                            'as_pool_get_components_by_launchable' => 0,
                                                            'as_pool_load_async' => 0,
                                                            'as_pool_load_finish' => 0,
                                                            'as_pool_new' => 0,
                                                            'as_pool_set_flags' => 0,
                                                            'bind_textdomain_codeset@GLIBC_2.2.5' => 0,
                                                            'bindtextdomain@GLIBC_2.2.5' => 0,
                                                            'bluetooth_adapter_state_get_type' => 0,
                                                            'bluetooth_client_connect_service' => 0,
                                                            'bluetooth_client_connect_service_finish' => 0,
                                                            'bluetooth_client_get_devices' => 0,
                                                            'bluetooth_client_get_type' => 0,
                                                            'bluetooth_client_new' => 0,
                                                            'bluetooth_device_get_object_path' => 0,
                                                            'bluetooth_device_get_type' => 0,
                                                            'cairo_arc' => 0,
                                                            'cairo_clip' => 0,
                                                            'cairo_close_path' => 0,
                                                            'cairo_create' => 0,
                                                            'cairo_destroy' => 0,
                                                            'cairo_fill' => 0,
                                                            'cairo_image_surface_create' => 0,
                                                            'cairo_image_surface_create_for_data' => 0,
                                                            'cairo_image_surface_get_height' => 0,
                                                            'cairo_image_surface_get_width' => 0,
                                                            'cairo_line_to' => 0,
                                                            'cairo_move_to' => 0,
                                                            'cairo_new_path' => 0,
                                                            'cairo_paint' => 0,
                                                            'cairo_pattern_add_color_stop_rgba' => 0,
                                                            'cairo_pattern_create_linear' => 0,
                                                            'cairo_pattern_destroy' => 0,
                                                            'cairo_pop_group_to_source' => 0,
                                                            'cairo_push_group' => 0,
                                                            'cairo_rectangle' => 0,
                                                            'cairo_region_create_rectangle' => 0,
                                                            'cairo_region_destroy' => 0,
                                                            'cairo_restore' => 0,
                                                            'cairo_save' => 0,
                                                            'cairo_scale' => 0,
                                                            'cairo_set_line_cap' => 0,
                                                            'cairo_set_line_width' => 0,
                                                            'cairo_set_operator' => 0,
                                                            'cairo_set_source' => 0,
                                                            'cairo_set_source_rgb' => 0,
                                                            'cairo_set_source_rgba' => 0,
                                                            'cairo_set_source_surface' => 0,
                                                            'cairo_stroke' => 0,
                                                            'cairo_surface_destroy' => 0,
                                                            'cairo_translate' => 0,
                                                            'call_audio_deinit@LIBCALLAUDIO_0_0_0' => 0,
                                                            'call_audio_enable_speaker_async@LIBCALLAUDIO_0_0_0' => 0,
                                                            'call_audio_init@LIBCALLAUDIO_0_0_0' => 0,
                                                            'call_audio_is_inited@LIBCALLAUDIO_0_0_0' => 0,
                                                            'call_audio_mute_mic_async@LIBCALLAUDIO_0_0_0' => 0,
                                                            'call_audio_select_mode_async@LIBCALLAUDIO_0_0_0' => 0,
                                                            'clock_gettime@GLIBC_2.17' => 0,
                                                            'close@GLIBC_2.2.5' => 0,
                                                            'cos@GLIBC_2.2.5' => 0,
                                                            'dcgettext@GLIBC_2.2.5' => 0,
                                                            'dcngettext@GLIBC_2.2.5' => 0,
                                                            'exp10@GLIBC_2.39' => 0,
                                                            'fcntl64@GLIBC_2.28' => 0,
                                                            'fmaxf@GLIBC_2.2.5' => 0,
                                                            'fmodf@GLIBC_2.38' => 0,
                                                            'fribidi_get_bidi_type' => 0,
                                                            'ftruncate64@GLIBC_2.2.5' => 0,
                                                            'g_action_get_enabled' => 0,
                                                            'g_action_group_activate_action' => 0,
                                                            'g_action_group_change_action_state' => 0,
                                                            'g_action_group_get_action_parameter_type' => 0,
                                                            'g_action_group_get_type' => 0,
                                                            'g_action_group_has_action' => 0,
                                                            'g_action_group_list_actions' => 0,
                                                            'g_action_group_query_action' => 0,
                                                            'g_action_map_add_action' => 0,
                                                            'g_action_map_add_action_entries' => 0,
                                                            'g_action_map_get_type' => 0,
                                                            'g_action_map_lookup_action' => 0,
                                                            'g_action_map_remove_action' => 0,
                                                            'g_app_info_equal' => 0,
                                                            'g_app_info_get_all' => 0,
                                                            'g_app_info_get_default_for_type' => 0,
                                                            'g_app_info_get_description' => 0,
                                                            'g_app_info_get_display_name' => 0,
                                                            'g_app_info_get_executable' => 0,
                                                            'g_app_info_get_icon' => 0,
                                                            'g_app_info_get_id' => 0,
                                                            'g_app_info_get_name' => 0,
                                                            'g_app_info_get_type' => 0,
                                                            'g_app_info_launch_uris_async' => 0,
                                                            'g_app_info_launch_uris_finish' => 0,
                                                            'g_app_info_monitor_get' => 0,
                                                            'g_app_info_should_show' => 0,
                                                            'g_array_append_vals' => 0,
                                                            'g_array_free' => 0,
                                                            'g_array_new' => 0,
                                                            'g_array_set_size' => 0,
                                                            'g_array_unref' => 0,
                                                            'g_ascii_strcasecmp' => 0,
                                                            'g_ascii_strdown' => 0,
                                                            'g_ascii_strtoll' => 0,
                                                            'g_ascii_table' => 0,
                                                            'g_ascii_tolower' => 0,
                                                            'g_ask_password_flags_get_type' => 0,
                                                            'g_assertion_message' => 0,
                                                            'g_assertion_message_expr' => 0,
                                                            'g_async_initable_get_type' => 0,
                                                            'g_async_initable_new_async' => 0,
                                                            'g_async_initable_new_finish' => 0,
                                                            'g_async_result_get_source_object' => 0,
                                                            'g_async_result_is_tagged' => 0,
                                                            'g_atomic_ref_count_dec' => 0,
                                                            'g_atomic_ref_count_inc' => 0,
                                                            'g_atomic_ref_count_init' => 0,
                                                            'g_binding_unbind' => 0,
                                                            'g_bookmark_file_add_application' => 0,
                                                            'g_bookmark_file_free' => 0,
                                                            'g_bookmark_file_load_from_file' => 0,
                                                            'g_bookmark_file_new' => 0,
                                                            'g_bookmark_file_to_file' => 0,
                                                            'g_boxed_type_register_static' => 0,
                                                            'g_build_filename' => 0,
                                                            'g_build_path' => 0,
                                                            'g_bus_get' => 0,
                                                            'g_bus_get_finish' => 0,
                                                            'g_bus_own_name' => 0,
                                                            'g_bus_unown_name' => 0,
                                                            'g_bus_unwatch_name' => 0,
                                                            'g_bus_watch_name' => 0,
                                                            'g_bus_watch_name_on_connection' => 0,
                                                            'g_bytes_get_data' => 0,
                                                            'g_bytes_get_size' => 0,
                                                            'g_bytes_new' => 0,
                                                            'g_bytes_new_take' => 0,
                                                            'g_bytes_unref' => 0,
                                                            'g_cancellable_cancel' => 0,
                                                            'g_cancellable_connect' => 0,
                                                            'g_cancellable_disconnect' => 0,
                                                            'g_cancellable_get_type' => 0,
                                                            'g_cancellable_new' => 0,
                                                            'g_cclosure_marshal_VOID__BOOLEAN' => 0,
                                                            'g_cclosure_marshal_VOID__OBJECT' => 0,
                                                            'g_cclosure_marshal_VOID__STRING' => 0,
                                                            'g_cclosure_marshal_VOID__UINT' => 0,
                                                            'g_cclosure_marshal_VOID__VOID' => 0,
                                                            'g_checksum_free' => 0,
                                                            'g_checksum_get_digest' => 0,
                                                            'g_checksum_get_string' => 0,
                                                            'g_checksum_new' => 0,
                                                            'g_checksum_update' => 0,
                                                            'g_child_watch_add' => 0,
                                                            'g_clear_error' => 0,
                                                            'g_close' => 0,
                                                            'g_datalist_clear' => 0,
                                                            'g_datalist_id_set_data_full' => 0,
                                                            'g_date_time_add_days' => 0,
                                                            'g_date_time_add_hours' => 0,
                                                            'g_date_time_add_minutes' => 0,
                                                            'g_date_time_add_months' => 0,
                                                            'g_date_time_add_seconds' => 0,
                                                            'g_date_time_compare' => 0,
                                                            'g_date_time_difference' => 0,
                                                            'g_date_time_format' => 0,
                                                            'g_date_time_get_type' => 0,
                                                            'g_date_time_new_now_local' => 0,
                                                            'g_date_time_ref' => 0,
                                                            'g_date_time_to_unix' => 0,
                                                            'g_date_time_unref' => 0,
                                                            'g_dbus_connection_call' => 0,
                                                            'g_dbus_connection_call_finish' => 0,
                                                            'g_dbus_connection_emit_signal' => 0,
                                                            'g_dbus_connection_get_type' => 0,
                                                            'g_dbus_connection_signal_subscribe' => 0,
                                                            'g_dbus_connection_signal_unsubscribe' => 0,
                                                            'g_dbus_error_quark' => 0,
                                                            'g_dbus_error_strip_remote_error' => 0,
                                                            'g_dbus_gvalue_to_gvariant' => 0,
                                                            'g_dbus_gvariant_to_gvalue' => 0,
                                                            'g_dbus_interface_get_info' => 0,
                                                            'g_dbus_interface_info_lookup_property' => 0,
                                                            'g_dbus_interface_info_lookup_signal' => 0,
                                                            'g_dbus_interface_skeleton_export' => 0,
                                                            'g_dbus_interface_skeleton_get_connection' => 0,
                                                            'g_dbus_interface_skeleton_get_connections' => 0,
                                                            'g_dbus_interface_skeleton_get_object_path' => 0,
                                                            'g_dbus_interface_skeleton_get_type' => 0,
                                                            'g_dbus_interface_skeleton_unexport' => 0,
                                                            'g_dbus_message_get_unix_fd_list' => 0,
                                                            'g_dbus_method_invocation_get_connection' => 0,
                                                            'g_dbus_method_invocation_get_message' => 0,
                                                            'g_dbus_method_invocation_get_method_info' => 0,
                                                            'g_dbus_method_invocation_get_sender' => 0,
                                                            'g_dbus_method_invocation_get_type' => 0,
                                                            'g_dbus_method_invocation_return_error' => 0,
                                                            'g_dbus_method_invocation_return_value' => 0,
                                                            'g_dbus_method_invocation_return_value_with_unix_fd_list' => 0,
                                                            'g_dbus_object_get_interface' => 0,
                                                            'g_dbus_object_get_object_path' => 0,
                                                            'g_dbus_object_get_type' => 0,
                                                            'g_dbus_object_manager_client_get_name' => 0,
                                                            'g_dbus_object_manager_client_get_name_owner' => 0,
                                                            'g_dbus_object_manager_client_get_type' => 0,
                                                            'g_dbus_object_manager_get_object_path' => 0,
                                                            'g_dbus_object_manager_get_objects' => 0,
                                                            'g_dbus_object_manager_server_export' => 0,
                                                            'g_dbus_object_manager_server_new' => 0,
                                                            'g_dbus_object_manager_server_set_connection' => 0,
                                                            'g_dbus_object_proxy_get_type' => 0,
                                                            'g_dbus_object_skeleton_add_interface' => 0,
                                                            'g_dbus_object_skeleton_get_type' => 0,
                                                            'g_dbus_object_skeleton_remove_interface_by_name' => 0,
                                                            'g_dbus_proxy_call' => 0,
                                                            'g_dbus_proxy_call_finish' => 0,
                                                            'g_dbus_proxy_call_sync' => 0,
                                                            'g_dbus_proxy_call_with_unix_fd_list' => 0,
                                                            'g_dbus_proxy_call_with_unix_fd_list_finish' => 0,
                                                            'g_dbus_proxy_call_with_unix_fd_list_sync' => 0,
                                                            'g_dbus_proxy_get_cached_property' => 0,
                                                            'g_dbus_proxy_get_name' => 0,
                                                            'g_dbus_proxy_get_name_owner' => 0,
                                                            'g_dbus_proxy_get_object_path' => 0,
                                                            'g_dbus_proxy_get_type' => 0,
                                                            'g_dbus_proxy_new_for_bus' => 0,
                                                            'g_dbus_proxy_new_for_bus_finish' => 0,
                                                            'g_dbus_proxy_set_interface_info' => 0,
                                                            'g_desktop_app_info_get_action_name' => 0,
                                                            'g_desktop_app_info_get_boolean' => 0,
                                                            'g_desktop_app_info_get_categories' => 0,
                                                            'g_desktop_app_info_get_generic_name' => 0,
                                                            'g_desktop_app_info_get_keywords' => 0,
                                                            'g_desktop_app_info_get_startup_wm_class' => 0,
                                                            'g_desktop_app_info_get_string' => 0,
                                                            'g_desktop_app_info_get_string_list' => 0,
                                                            'g_desktop_app_info_get_type' => 0,
                                                            'g_desktop_app_info_launch_action' => 0,
                                                            'g_desktop_app_info_launch_uris_as_manager' => 0,
                                                            'g_desktop_app_info_list_actions' => 0,
                                                            'g_desktop_app_info_new' => 0,
                                                            'g_dgettext' => 0,
                                                            'g_direct_equal' => 0,
                                                            'g_direct_hash' => 0,
                                                            'g_dpgettext' => 0,
                                                            'g_drive_get_name' => 0,
                                                            'g_drive_get_type' => 0,
                                                            'g_enum_register_static' => 0,
                                                            'g_enum_to_string' => 0,
                                                            'g_error_free' => 0,
                                                            'g_error_get_type' => 0,
                                                            'g_error_matches' => 0,
                                                            'g_error_new' => 0,
                                                            'g_file_create' => 0,
                                                            'g_file_equal' => 0,
                                                            'g_file_get_contents' => 0,
                                                            'g_file_get_path' => 0,
                                                            'g_file_get_type' => 0,
                                                            'g_file_get_uri' => 0,
                                                            'g_file_hash' => 0,
                                                            'g_file_icon_new' => 0,
                                                            'g_file_make_directory_with_parents' => 0,
                                                            'g_file_monitor_file' => 0,
                                                            'g_file_new_for_path' => 0,
                                                            'g_file_new_for_uri' => 0,
                                                            'g_file_peek_path' => 0,
                                                            'g_file_read' => 0,
                                                            'g_file_test' => 0,
                                                            'g_filename_to_uri' => 0,
                                                            'g_find_program_in_path' => 0,
                                                            'g_flags_register_static' => 0,
                                                            'g_flags_to_string' => 0,
                                                            'g_free' => 0,
                                                            'g_get_home_dir' => 0,
                                                            'g_get_host_name' => 0,
                                                            'g_get_monotonic_time' => 0,
                                                            'g_get_real_name' => 0,
                                                            'g_get_system_data_dirs' => 0,
                                                            'g_get_user_cache_dir' => 0,
                                                            'g_get_user_data_dir' => 0,
                                                            'g_get_user_name' => 0,
                                                            'g_get_user_special_dir' => 0,
                                                            'g_getenv' => 0,
                                                            'g_hash_table_contains' => 0,
                                                            'g_hash_table_destroy' => 0,
                                                            'g_hash_table_find' => 0,
                                                            'g_hash_table_foreach' => 0,
                                                            'g_hash_table_get_type' => 0,
                                                            'g_hash_table_get_values' => 0,
                                                            'g_hash_table_insert' => 0,
                                                            'g_hash_table_iter_init' => 0,
                                                            'g_hash_table_iter_next' => 0,
                                                            'g_hash_table_iter_remove' => 0,
                                                            'g_hash_table_lookup' => 0,
                                                            'g_hash_table_new' => 0,
                                                            'g_hash_table_new_full' => 0,
                                                            'g_hash_table_remove' => 0,
                                                            'g_hash_table_remove_all' => 0,
                                                            'g_hash_table_replace' => 0,
                                                            'g_hash_table_size' => 0,
                                                            'g_hash_table_unref' => 0,
                                                            'g_hostname_to_ascii' => 0,
                                                            'g_icon_get_type' => 0,
                                                            'g_idle_add' => 0,
                                                            'g_idle_add_once' => 0,
                                                            'g_idle_source_new' => 0,
                                                            'g_initable_get_type' => 0,
                                                            'g_initable_new' => 0,
                                                            'g_input_stream_close' => 0,
                                                            'g_input_stream_read_async' => 0,
                                                            'g_input_stream_read_finish' => 0,
                                                            'g_int_equal' => 0,
                                                            'g_int_hash' => 0,
                                                            'g_intern_static_string' => 0,
                                                            'g_io_add_watch' => 0,
                                                            'g_io_channel_read_chars' => 0,
                                                            'g_io_channel_set_buffered' => 0,
                                                            'g_io_channel_set_encoding' => 0,
                                                            'g_io_channel_shutdown' => 0,
                                                            'g_io_channel_unix_new' => 0,
                                                            'g_io_channel_unref' => 0,
                                                            'g_io_error_from_errno' => 0,
                                                            'g_io_error_quark' => 0,
                                                            'g_io_extension_get_type' => 0,
                                                            'g_io_extension_point_get_extension_by_name' => 0,
                                                            'g_io_extension_point_lookup' => 0,
                                                            'g_io_extension_point_register' => 0,
                                                            'g_io_extension_point_set_required_type' => 0,
                                                            'g_io_modules_scan_all_in_directory' => 0,
                                                            'g_key_file_get_boolean' => 0,
                                                            'g_key_file_get_groups' => 0,
                                                            'g_key_file_get_locale_string' => 0,
                                                            'g_key_file_get_string' => 0,
                                                            'g_key_file_load_from_data' => 0,
                                                            'g_key_file_load_from_file' => 0,
                                                            'g_key_file_new' => 0,
                                                            'g_key_file_unref' => 0,
                                                            'g_list_append' => 0,
                                                            'g_list_concat' => 0,
                                                            'g_list_copy' => 0,
                                                            'g_list_delete_link' => 0,
                                                            'g_list_foreach' => 0,
                                                            'g_list_free' => 0,
                                                            'g_list_free_full' => 0,
                                                            'g_list_last' => 0,
                                                            'g_list_length' => 0,
                                                            'g_list_model_get_item' => 0,
                                                            'g_list_model_get_item_type' => 0,
                                                            'g_list_model_get_n_items' => 0,
                                                            'g_list_model_get_object' => 0,
                                                            'g_list_model_get_type' => 0,
                                                            'g_list_model_items_changed' => 0,
                                                            'g_list_nth_data' => 0,
                                                            'g_list_prepend' => 0,
                                                            'g_list_remove' => 0,
                                                            'g_list_reverse' => 0,
                                                            'g_list_sort' => 0,
                                                            'g_list_store_append' => 0,
                                                            'g_list_store_find' => 0,
                                                            'g_list_store_find_with_equal_func' => 0,
                                                            'g_list_store_get_type' => 0,
                                                            'g_list_store_insert' => 0,
                                                            'g_list_store_new' => 0,
                                                            'g_list_store_remove' => 0,
                                                            'g_list_store_remove_all' => 0,
                                                            'g_loadable_icon_get_type' => 0,
                                                            'g_loadable_icon_load_async' => 0,
                                                            'g_loadable_icon_load_finish' => 0,
                                                            'g_locale_to_utf8' => 0,
                                                            'g_log' => 0,
                                                            'g_log_structured_standard' => 0,
                                                            'g_main_context_default' => 0,
                                                            'g_main_context_ref_thread_default' => 0,
                                                            'g_main_context_unref' => 0,
                                                            'g_malloc' => 0,
                                                            'g_malloc0' => 0,
                                                            'g_malloc0_n' => 0,
                                                            'g_malloc_n' => 0,
                                                            'g_markup_escape_text' => 0,
                                                            'g_match_info_fetch' => 0,
                                                            'g_match_info_unref' => 0,
                                                            'g_memdup2' => 0,
                                                            'g_menu_append' => 0,
                                                            'g_menu_append_item' => 0,
                                                            'g_menu_append_section' => 0,
                                                            'g_menu_item_new_submenu' => 0,
                                                            'g_menu_new' => 0,
                                                            'g_menu_remove_all' => 0,
                                                            'g_mkdir_with_parents' => 0,
                                                            'g_module_supported' => 0,
                                                            'g_mount_get_name' => 0,
                                                            'g_mount_get_root' => 0,
                                                            'g_mount_get_symbolic_icon' => 0,
                                                            'g_mount_get_type' => 0,
                                                            'g_mount_operation_get_type' => 0,
                                                            'g_mount_operation_reply' => 0,
                                                            'g_mount_operation_set_password' => 0,
                                                            'g_mutex_clear' => 0,
                                                            'g_mutex_init' => 0,
                                                            'g_mutex_lock' => 0,
                                                            'g_mutex_unlock' => 0,
                                                            'g_object_add_weak_pointer' => 0,
                                                            'g_object_bind_property' => 0,
                                                            'g_object_bind_property_full' => 0,
                                                            'g_object_class_find_property' => 0,
                                                            'g_object_class_install_properties' => 0,
                                                            'g_object_class_install_property' => 0,
                                                            'g_object_class_override_property' => 0,
                                                            'g_object_connect' => 0,
                                                            'g_object_freeze_notify' => 0,
                                                            'g_object_get' => 0,
                                                            'g_object_get_data' => 0,
                                                            'g_object_get_property' => 0,
                                                            'g_object_interface_install_property' => 0,
                                                            'g_object_new' => 0,
                                                            'g_object_notify' => 0,
                                                            'g_object_notify_by_pspec' => 0,
                                                            'g_object_ref' => 0,
                                                            'g_object_ref_sink' => 0,
                                                            'g_object_remove_weak_pointer' => 0,
                                                            'g_object_run_dispose' => 0,
                                                            'g_object_set' => 0,
                                                            'g_object_set_data' => 0,
                                                            'g_object_set_data_full' => 0,
                                                            'g_object_set_property' => 0,
                                                            'g_object_thaw_notify' => 0,
                                                            'g_object_unref' => 0,
                                                            'g_object_weak_ref' => 0,
                                                            'g_object_weak_unref' => 0,
                                                            'g_once_init_enter' => 0,
                                                            'g_once_init_enter_pointer' => 0,
                                                            'g_once_init_leave' => 0,
                                                            'g_once_init_leave_pointer' => 0,
                                                            'g_output_stream_close' => 0,
                                                            'g_output_stream_write_async' => 0,
                                                            'g_output_stream_write_finish' => 0,
                                                            'g_param_spec_boolean' => 0,
                                                            'g_param_spec_boxed' => 0,
                                                            'g_param_spec_double' => 0,
                                                            'g_param_spec_enum' => 0,
                                                            'g_param_spec_flags' => 0,
                                                            'g_param_spec_float' => 0,
                                                            'g_param_spec_get_name' => 0,
                                                            'g_param_spec_gtype' => 0,
                                                            'g_param_spec_int' => 0,
                                                            'g_param_spec_long' => 0,
                                                            'g_param_spec_object' => 0,
                                                            'g_param_spec_pointer' => 0,
                                                            'g_param_spec_string' => 0,
                                                            'g_param_spec_uint' => 0,
                                                            'g_param_spec_ulong' => 0,
                                                            'g_param_spec_variant' => 0,
                                                            'g_parse_debug_string' => 0,
                                                            'g_path_get_basename' => 0,
                                                            'g_path_get_dirname' => 0,
                                                            'g_path_is_absolute' => 0,
                                                            'g_propagate_error' => 0,
                                                            'g_property_action_new' => 0,
                                                            'g_ptr_array_add' => 0,
                                                            'g_ptr_array_copy' => 0,
                                                            'g_ptr_array_find' => 0,
                                                            'g_ptr_array_free' => 0,
                                                            'g_ptr_array_new' => 0,
                                                            'g_ptr_array_new_with_free_func' => 0,
                                                            'g_ptr_array_ref' => 0,
                                                            'g_ptr_array_remove' => 0,
                                                            'g_ptr_array_remove_fast' => 0,
                                                            'g_ptr_array_remove_range' => 0,
                                                            'g_ptr_array_sized_new' => 0,
                                                            'g_ptr_array_unref' => 0,
                                                            'g_quark_from_static_string' => 0,
                                                            'g_quark_to_string' => 0,
                                                            'g_quark_try_string' => 0,
                                                            'g_random_int_range' => 0,
                                                            'g_regex_match' => 0,
                                                            'g_regex_new' => 0,
                                                            'g_regex_replace_literal' => 0,
                                                            'g_regex_unref' => 0,
                                                            'g_return_if_fail_warning' => 0,
                                                            'g_sequence_append' => 0,
                                                            'g_sequence_free' => 0,
                                                            'g_sequence_get' => 0,
                                                            'g_sequence_get_begin_iter' => 0,
                                                            'g_sequence_get_end_iter' => 0,
                                                            'g_sequence_get_iter_at_pos' => 0,
                                                            'g_sequence_get_length' => 0,
                                                            'g_sequence_insert_before' => 0,
                                                            'g_sequence_insert_sorted' => 0,
                                                            'g_sequence_iter_get_position' => 0,
                                                            'g_sequence_iter_is_begin' => 0,
                                                            'g_sequence_iter_is_end' => 0,
                                                            'g_sequence_iter_next' => 0,
                                                            'g_sequence_iter_prev' => 0,
                                                            'g_sequence_move' => 0,
                                                            'g_sequence_new' => 0,
                                                            'g_sequence_prepend' => 0,
                                                            'g_sequence_remove' => 0,
                                                            'g_sequence_remove_range' => 0,
                                                            'g_sequence_sort' => 0,
                                                            'g_set_error' => 0,
                                                            'g_set_error_literal' => 0,
                                                            'g_settings_bind' => 0,
                                                            'g_settings_get_boolean' => 0,
                                                            'g_settings_get_enum' => 0,
                                                            'g_settings_get_flags' => 0,
                                                            'g_settings_get_int' => 0,
                                                            'g_settings_get_string' => 0,
                                                            'g_settings_get_strv' => 0,
                                                            'g_settings_get_type' => 0,
                                                            'g_settings_get_uint' => 0,
                                                            'g_settings_get_value' => 0,
                                                            'g_settings_new' => 0,
                                                            'g_settings_new_with_path' => 0,
                                                            'g_settings_reset' => 0,
                                                            'g_settings_schema_has_key' => 0,
                                                            'g_settings_schema_source_get_default' => 0,
                                                            'g_settings_schema_source_lookup' => 0,
                                                            'g_settings_schema_unref' => 0,
                                                            'g_settings_set_boolean' => 0,
                                                            'g_settings_set_string' => 0,
                                                            'g_settings_set_strv' => 0,
                                                            'g_shell_parse_argv' => 0,
                                                            'g_signal_accumulator_true_handled' => 0,
                                                            'g_signal_add_emission_hook' => 0,
                                                            'g_signal_connect_data' => 0,
                                                            'g_signal_connect_object' => 0,
                                                            'g_signal_emit' => 0,
                                                            'g_signal_emit_by_name' => 0,
                                                            'g_signal_emitv' => 0,
                                                            'g_signal_handler_block' => 0,
                                                            'g_signal_handler_disconnect' => 0,
                                                            'g_signal_handler_unblock' => 0,
                                                            'g_signal_handlers_block_matched' => 0,
                                                            'g_signal_handlers_disconnect_matched' => 0,
                                                            'g_signal_handlers_unblock_matched' => 0,
                                                            'g_signal_lookup' => 0,
                                                            'g_signal_new' => 0,
                                                            'g_signal_new_class_handler' => 0,
                                                            'g_signal_remove_emission_hook' => 0,
                                                            'g_signal_set_va_marshaller' => 0,
                                                            'g_signal_stop_emission_by_name' => 0,
                                                            'g_simple_action_group_get_type' => 0,
                                                            'g_simple_action_group_new' => 0,
                                                            'g_simple_action_set_enabled' => 0,
                                                            'g_slice_alloc' => 0,
                                                            'g_slice_alloc0' => 0,
                                                            'g_slice_free1' => 0,
                                                            'g_slist_prepend' => 0,
                                                            'g_slist_sort' => 0,
                                                            'g_source_attach' => 0,
                                                            'g_source_destroy' => 0,
                                                            'g_source_remove' => 0,
                                                            'g_source_set_callback' => 0,
                                                            'g_source_set_name' => 0,
                                                            'g_source_set_name_by_id' => 0,
                                                            'g_source_set_priority' => 0,
                                                            'g_source_unref' => 0,
                                                            'g_spawn_async' => 0,
                                                            'g_spawn_async_with_pipes' => 0,
                                                            'g_spawn_check_wait_status' => 0,
                                                            'g_spawn_close_pid' => 0,
                                                            'g_static_resource_fini' => 0,
                                                            'g_static_resource_get_resource' => 0,
                                                            'g_static_resource_init' => 0,
                                                            'g_str_equal' => 0,
                                                            'g_str_has_prefix' => 0,
                                                            'g_str_has_suffix' => 0,
                                                            'g_str_hash' => 0,
                                                            'g_strcanon' => 0,
                                                            'g_strchomp' => 0,
                                                            'g_strchug' => 0,
                                                            'g_strcmp0' => 0,
                                                            'g_strconcat' => 0,
                                                            'g_strdup' => 0,
                                                            'g_strdup_printf' => 0,
                                                            'g_strdup_vprintf' => 0,
                                                            'g_strdupv' => 0,
                                                            'g_strerror' => 0,
                                                            'g_strfreev' => 0,
                                                            'g_string_append_len' => 0,
                                                            'g_string_append_printf' => 0,
                                                            'g_string_free' => 0,
                                                            'g_string_free_and_steal' => 0,
                                                            'g_string_insert_c' => 0,
                                                            'g_string_insert_len' => 0,
                                                            'g_string_new' => 0,
                                                            'g_string_new_len' => 0,
                                                            'g_strjoin' => 0,
                                                            'g_strjoinv' => 0,
                                                            'g_strndup' => 0,
                                                            'g_strrstr' => 0,
                                                            'g_strsplit' => 0,
                                                            'g_strv_builder_add' => 0,
                                                            'g_strv_builder_addv' => 0,
                                                            'g_strv_builder_end' => 0,
                                                            'g_strv_builder_new' => 0,
                                                            'g_strv_builder_take' => 0,
                                                            'g_strv_builder_unref' => 0,
                                                            'g_strv_contains' => 0,
                                                            'g_strv_get_type' => 0,
                                                            'g_strv_length' => 0,
                                                            'g_task_get_name' => 0,
                                                            'g_task_get_source_object' => 0,
                                                            'g_task_get_task_data' => 0,
                                                            'g_task_get_type' => 0,
                                                            'g_task_is_valid' => 0,
                                                            'g_task_new' => 0,
                                                            'g_task_propagate_boolean' => 0,
                                                            'g_task_propagate_int' => 0,
                                                            'g_task_propagate_pointer' => 0,
                                                            'g_task_return_boolean' => 0,
                                                            'g_task_return_error' => 0,
                                                            'g_task_return_int' => 0,
                                                            'g_task_return_new_error' => 0,
                                                            'g_task_return_pointer' => 0,
                                                            'g_task_run_in_thread' => 0,
                                                            'g_task_set_source_tag' => 0,
                                                            'g_task_set_static_name' => 0,
                                                            'g_task_set_task_data' => 0,
                                                            'g_themed_icon_append_name' => 0,
                                                            'g_themed_icon_get_type' => 0,
                                                            'g_themed_icon_new' => 0,
                                                            'g_themed_icon_new_with_default_fallbacks' => 0,
                                                            'g_timeout_add' => 0,
                                                            'g_timeout_add_once' => 0,
                                                            'g_timeout_add_seconds' => 0,
                                                            'g_timeout_add_seconds_once' => 0,
                                                            'g_timer_destroy' => 0,
                                                            'g_timer_elapsed' => 0,
                                                            'g_timer_new' => 0,
                                                            'g_timer_stop' => 0,
                                                            'g_type_add_instance_private' => 0,
                                                            'g_type_add_interface_static' => 0,
                                                            'g_type_check_instance_is_a' => 0,
                                                            'g_type_check_value_holds' => 0,
                                                            'g_type_class_adjust_private_offset' => 0,
                                                            'g_type_class_peek_parent' => 0,
                                                            'g_type_class_ref' => 0,
                                                            'g_type_class_unref' => 0,
                                                            'g_type_ensure' => 0,
                                                            'g_type_interface_add_prerequisite' => 0,
                                                            'g_type_interface_peek' => 0,
                                                            'g_type_interface_peek_parent' => 0,
                                                            'g_type_is_a' => 0,
                                                            'g_type_name' => 0,
                                                            'g_type_register_static_simple' => 0,
                                                            'g_udev_client_new' => 0,
                                                            'g_udev_client_query_by_subsystem' => 0,
                                                            'g_udev_device_get_name' => 0,
                                                            'g_udev_device_get_parent' => 0,
                                                            'g_udev_device_get_subsystem' => 0,
                                                            'g_udev_device_get_sysfs_attr' => 0,
                                                            'g_udev_device_get_sysfs_attr_as_int' => 0,
                                                            'g_udev_device_get_sysfs_attr_as_int_uncached' => 0,
                                                            'g_udev_device_get_sysfs_path' => 0,
                                                            'g_udev_device_get_type' => 0,
                                                            'g_udev_enumerator_add_match_name' => 0,
                                                            'g_udev_enumerator_add_match_subsystem' => 0,
                                                            'g_udev_enumerator_execute' => 0,
                                                            'g_udev_enumerator_new' => 0,
                                                            'g_unix_fd_list_get' => 0,
                                                            'g_unix_fd_list_get_length' => 0,
                                                            'g_unix_fd_list_get_type' => 0,
                                                            'g_unix_input_stream_new' => 0,
                                                            'g_unix_output_stream_new' => 0,
                                                            'g_unsetenv' => 0,
                                                            'g_uri_peek_scheme' => 0,
                                                            'g_utf8_casefold' => 0,
                                                            'g_utf8_collate' => 0,
                                                            'g_utf8_find_next_char' => 0,
                                                            'g_utf8_get_char' => 0,
                                                            'g_utf8_skip' => 0,
                                                            'g_utf8_strdown' => 0,
                                                            'g_utf8_validate' => 0,
                                                            'g_uuid_string_random' => 0,
                                                            'g_value_copy' => 0,
                                                            'g_value_dup_boxed' => 0,
                                                            'g_value_dup_object' => 0,
                                                            'g_value_dup_string' => 0,
                                                            'g_value_dup_variant' => 0,
                                                            'g_value_get_boolean' => 0,
                                                            'g_value_get_boxed' => 0,
                                                            'g_value_get_double' => 0,
                                                            'g_value_get_enum' => 0,
                                                            'g_value_get_flags' => 0,
                                                            'g_value_get_float' => 0,
                                                            'g_value_get_gtype' => 0,
                                                            'g_value_get_int' => 0,
                                                            'g_value_get_int64' => 0,
                                                            'g_value_get_long' => 0,
                                                            'g_value_get_object' => 0,
                                                            'g_value_get_pointer' => 0,
                                                            'g_value_get_string' => 0,
                                                            'g_value_get_uchar' => 0,
                                                            'g_value_get_uint' => 0,
                                                            'g_value_get_uint64' => 0,
                                                            'g_value_get_ulong' => 0,
                                                            'g_value_get_variant' => 0,
                                                            'g_value_init' => 0,
                                                            'g_value_peek_pointer' => 0,
                                                            'g_value_set_boolean' => 0,
                                                            'g_value_set_boxed' => 0,
                                                            'g_value_set_double' => 0,
                                                            'g_value_set_enum' => 0,
                                                            'g_value_set_flags' => 0,
                                                            'g_value_set_float' => 0,
                                                            'g_value_set_gtype' => 0,
                                                            'g_value_set_int' => 0,
                                                            'g_value_set_long' => 0,
                                                            'g_value_set_object' => 0,
                                                            'g_value_set_pointer' => 0,
                                                            'g_value_set_schar' => 0,
                                                            'g_value_set_string' => 0,
                                                            'g_value_set_uint' => 0,
                                                            'g_value_set_ulong' => 0,
                                                            'g_value_set_variant' => 0,
                                                            'g_value_take_object' => 0,
                                                            'g_value_take_string' => 0,
                                                            'g_value_unset' => 0,
                                                            'g_variant_builder_add' => 0,
                                                            'g_variant_builder_add_value' => 0,
                                                            'g_variant_builder_clear' => 0,
                                                            'g_variant_builder_end' => 0,
                                                            'g_variant_builder_init' => 0,
                                                            'g_variant_builder_init_static' => 0,
                                                            'g_variant_builder_new' => 0,
                                                            'g_variant_builder_unref' => 0,
                                                            'g_variant_dict_clear' => 0,
                                                            'g_variant_dict_end' => 0,
                                                            'g_variant_dict_init' => 0,
                                                            'g_variant_dict_insert' => 0,
                                                            'g_variant_dict_insert_value' => 0,
                                                            'g_variant_dict_lookup' => 0,
                                                            'g_variant_dict_new' => 0,
                                                            'g_variant_dict_unref' => 0,
                                                            'g_variant_dup_string' => 0,
                                                            'g_variant_equal' => 0,
                                                            'g_variant_get' => 0,
                                                            'g_variant_get_boolean' => 0,
                                                            'g_variant_get_byte' => 0,
                                                            'g_variant_get_bytestring' => 0,
                                                            'g_variant_get_child' => 0,
                                                            'g_variant_get_child_value' => 0,
                                                            'g_variant_get_data' => 0,
                                                            'g_variant_get_double' => 0,
                                                            'g_variant_get_int32' => 0,
                                                            'g_variant_get_int64' => 0,
                                                            'g_variant_get_size' => 0,
                                                            'g_variant_get_string' => 0,
                                                            'g_variant_get_type_string' => 0,
                                                            'g_variant_get_uint32' => 0,
                                                            'g_variant_get_variant' => 0,
                                                            'g_variant_is_object_path' => 0,
                                                            'g_variant_is_of_type' => 0,
                                                            'g_variant_iter_free' => 0,
                                                            'g_variant_iter_init' => 0,
                                                            'g_variant_iter_loop' => 0,
                                                            'g_variant_iter_n_children' => 0,
                                                            'g_variant_iter_next' => 0,
                                                            'g_variant_iter_next_value' => 0,
                                                            'g_variant_lookup' => 0,
                                                            'g_variant_lookup_value' => 0,
                                                            'g_variant_n_children' => 0,
                                                            'g_variant_new' => 0,
                                                            'g_variant_new_array' => 0,
                                                            'g_variant_new_boolean' => 0,
                                                            'g_variant_new_from_bytes' => 0,
                                                            'g_variant_new_int32' => 0,
                                                            'g_variant_new_int64' => 0,
                                                            'g_variant_new_parsed' => 0,
                                                            'g_variant_new_string' => 0,
                                                            'g_variant_new_take_string' => 0,
                                                            'g_variant_new_tuple' => 0,
                                                            'g_variant_new_uint32' => 0,
                                                            'g_variant_ref' => 0,
                                                            'g_variant_ref_sink' => 0,
                                                            'g_variant_take_ref' => 0,
                                                            'g_variant_type_checked_' => 0,
                                                            'g_variant_unref' => 0,
                                                            'g_volume_can_mount' => 0,
                                                            'g_volume_get_mount' => 0,
                                                            'g_volume_get_name' => 0,
                                                            'g_volume_get_type' => 0,
                                                            'g_volume_monitor_get' => 0,
                                                            'g_volume_monitor_get_volumes' => 0,
                                                            'g_volume_mount' => 0,
                                                            'g_volume_mount_finish' => 0,
                                                            'g_volume_should_automount' => 0,
                                                            'g_warn_message' => 0,
                                                            'gcr_prompt_close' => 0,
                                                            'gcr_prompt_get_type' => 0,
                                                            'gcr_prompt_set_warning' => 0,
                                                            'gcr_secure_entry_buffer_new' => 0,
                                                            'gcr_system_prompter_get_type' => 0,
                                                            'gcr_system_prompter_new' => 0,
                                                            'gcr_system_prompter_register' => 0,
                                                            'gcr_system_prompter_unregister' => 0,
                                                            'gdk_cairo_set_source_pixbuf' => 0,
                                                            'gdk_device_get_source' => 0,
                                                            'gdk_display_get_app_launch_context' => 0,
                                                            'gdk_display_get_default' => 0,
                                                            'gdk_display_get_default_seat' => 0,
                                                            'gdk_event_get_keyval' => 0,
                                                            'gdk_event_get_source_device' => 0,
                                                            'gdk_event_triggers_context_menu' => 0,
                                                            'gdk_frame_clock_get_frame_time' => 0,
                                                            'gdk_pixbuf_apply_embedded_orientation' => 0,
                                                            'gdk_pixbuf_composite' => 0,
                                                            'gdk_pixbuf_copy_area' => 0,
                                                            'gdk_pixbuf_copy_options' => 0,
                                                            'gdk_pixbuf_fill' => 0,
                                                            'gdk_pixbuf_flip' => 0,
                                                            'gdk_pixbuf_get_from_surface' => 0,
                                                            'gdk_pixbuf_get_has_alpha' => 0,
                                                            'gdk_pixbuf_get_height' => 0,
                                                            'gdk_pixbuf_get_type' => 0,
                                                            'gdk_pixbuf_get_width' => 0,
                                                            'gdk_pixbuf_loader_close' => 0,
                                                            'gdk_pixbuf_loader_get_pixbuf' => 0,
                                                            'gdk_pixbuf_loader_new' => 0,
                                                            'gdk_pixbuf_loader_write_bytes' => 0,
                                                            'gdk_pixbuf_new' => 0,
                                                            'gdk_pixbuf_new_from_bytes' => 0,
                                                            'gdk_pixbuf_new_from_data' => 0,
                                                            'gdk_pixbuf_new_from_stream' => 0,
                                                            'gdk_pixbuf_new_from_stream_async' => 0,
                                                            'gdk_pixbuf_new_from_stream_finish' => 0,
                                                            'gdk_pixbuf_rotate_simple' => 0,
                                                            'gdk_pixbuf_save_to_stream_async' => 0,
                                                            'gdk_pixbuf_save_to_stream_finish' => 0,
                                                            'gdk_pixbuf_scale' => 0,
                                                            'gdk_pixbuf_scale_simple' => 0,
                                                            'gdk_rectangle_get_type' => 0,
                                                            'gdk_rectangle_intersect' => 0,
                                                            'gdk_rgba_equal' => 0,
                                                            'gdk_rgba_parse' => 0,
                                                            'gdk_screen_get_default' => 0,
                                                            'gdk_seat_get_slaves' => 0,
                                                            'gdk_seat_get_type' => 0,
                                                            'gdk_set_allowed_backends' => 0,
                                                            'gdk_wayland_display_get_wl_display' => 0,
                                                            'gdk_wayland_window_get_wl_surface' => 0,
                                                            'gdk_wayland_window_set_use_custom_surface' => 0,
                                                            'getpid@GLIBC_2.2.5' => 0,
                                                            'getpwuid_r@GLIBC_2.2.5' => 0,
                                                            'getuid@GLIBC_2.2.5' => 0,
                                                            'gm_cutout_get_bounds' => 0,
                                                            'gm_device_info_get_display_panel' => 0,
                                                            'gm_device_info_new' => 0,
                                                            'gm_device_tree_get_compatibles' => 0,
                                                            'gm_display_panel_get_border_radius' => 0,
                                                            'gm_display_panel_get_cutouts' => 0,
                                                            'gm_display_panel_get_type' => 0,
                                                            'gnome_bg_slide_show_get_slide' => 0,
                                                            'gnome_bg_slide_show_get_type' => 0,
                                                            'gnome_bg_slide_show_load_async' => 0,
                                                            'gnome_bg_slide_show_new' => 0,
                                                            'gnome_start_systemd_scope' => 0,
                                                            'gnome_start_systemd_scope_finish' => 0,
                                                            'gnome_wall_clock_get_clock' => 0,
                                                            'gnome_wall_clock_get_type' => 0,
                                                            'gnome_wall_clock_new' => 0,
                                                            'gnome_wall_clock_string_for_datetime' => 0,
                                                            'gnome_xkb_info_get_layout_info' => 0,
                                                            'gnome_xkb_info_new' => 0,
                                                            'gtk_adjustment_get_value' => 0,
                                                            'gtk_adjustment_new' => 0,
                                                            'gtk_adjustment_set_page_increment' => 0,
                                                            'gtk_adjustment_set_step_increment' => 0,
                                                            'gtk_adjustment_set_upper' => 0,
                                                            'gtk_adjustment_set_value' => 0,
                                                            'gtk_bin_get_child' => 0,
                                                            'gtk_bin_get_type' => 0,
                                                            'gtk_binding_entry_add_signal' => 0,
                                                            'gtk_binding_set_by_class' => 0,
                                                            'gtk_box_get_type' => 0,
                                                            'gtk_box_pack_end' => 0,
                                                            'gtk_box_pack_start' => 0,
                                                            'gtk_box_reorder_child' => 0,
                                                            'gtk_box_set_center_widget' => 0,
                                                            'gtk_buildable_get_type' => 0,
                                                            'gtk_button_clicked' => 0,
                                                            'gtk_button_get_type' => 0,
                                                            'gtk_button_new_with_label' => 0,
                                                            'gtk_button_set_label' => 0,
                                                            'gtk_clipboard_get_for_display' => 0,
                                                            'gtk_clipboard_set_image' => 0,
                                                            'gtk_container_add' => 0,
                                                            'gtk_container_class_handle_border_width' => 0,
                                                            'gtk_container_foreach' => 0,
                                                            'gtk_container_get_children' => 0,
                                                            'gtk_container_get_type' => 0,
                                                            'gtk_container_propagate_draw' => 0,
                                                            'gtk_container_remove' => 0,
                                                            'gtk_css_provider_load_from_data' => 0,
                                                            'gtk_css_provider_load_from_resource' => 0,
                                                            'gtk_css_provider_new' => 0,
                                                            'gtk_drawing_area_get_type' => 0,
                                                            'gtk_editable_delete_text' => 0,
                                                            'gtk_editable_get_type' => 0,
                                                            'gtk_editable_insert_text' => 0,
                                                            'gtk_entry_buffer_get_text' => 0,
                                                            'gtk_entry_buffer_set_text' => 0,
                                                            'gtk_entry_get_alignment' => 0,
                                                            'gtk_entry_get_text' => 0,
                                                            'gtk_entry_get_text_length' => 0,
                                                            'gtk_entry_get_type' => 0,
                                                            'gtk_entry_grab_focus_without_selecting' => 0,
                                                            'gtk_entry_im_context_filter_keypress' => 0,
                                                            'gtk_entry_set_alignment' => 0,
                                                            'gtk_entry_set_buffer' => 0,
                                                            'gtk_entry_set_icon_from_icon_name' => 0,
                                                            'gtk_entry_set_text' => 0,
                                                            'gtk_entry_set_visibility' => 0,
                                                            'gtk_event_box_get_type' => 0,
                                                            'gtk_event_controller_reset' => 0,
                                                            'gtk_flow_box_bind_model' => 0,
                                                            'gtk_flow_box_child_get_type' => 0,
                                                            'gtk_flow_box_get_child_at_index' => 0,
                                                            'gtk_gesture_get_last_event' => 0,
                                                            'gtk_gesture_long_press_get_type' => 0,
                                                            'gtk_gesture_set_sequence_state' => 0,
                                                            'gtk_gesture_set_state' => 0,
                                                            'gtk_gesture_single_get_current_sequence' => 0,
                                                            'gtk_gesture_single_get_type' => 0,
                                                            'gtk_grid_attach' => 0,
                                                            'gtk_grid_get_child_at' => 0,
                                                            'gtk_grid_get_type' => 0,
                                                            'gtk_grid_remove_row' => 0,
                                                            'gtk_icon_size_get_type' => 0,
                                                            'gtk_icon_theme_add_resource_path' => 0,
                                                            'gtk_icon_theme_get_default' => 0,
                                                            'gtk_image_get_type' => 0,
                                                            'gtk_image_new_from_gicon' => 0,
                                                            'gtk_image_new_from_icon_name' => 0,
                                                            'gtk_image_set_from_gicon' => 0,
                                                            'gtk_image_set_from_icon_name' => 0,
                                                            'gtk_image_set_pixel_size' => 0,
                                                            'gtk_label_get_label' => 0,
                                                            'gtk_label_get_text' => 0,
                                                            'gtk_label_get_type' => 0,
                                                            'gtk_label_new' => 0,
                                                            'gtk_label_set_attributes' => 0,
                                                            'gtk_label_set_label' => 0,
                                                            'gtk_label_set_line_wrap' => 0,
                                                            'gtk_label_set_single_line_mode' => 0,
                                                            'gtk_label_set_text' => 0,
                                                            'gtk_level_bar_set_max_value' => 0,
                                                            'gtk_level_bar_set_value' => 0,
                                                            'gtk_list_box_bind_model' => 0,
                                                            'gtk_list_box_get_row_at_y' => 0,
                                                            'gtk_list_box_get_type' => 0,
                                                            'gtk_list_box_insert' => 0,
                                                            'gtk_list_box_row_get_index' => 0,
                                                            'gtk_list_box_row_get_type' => 0,
                                                            'gtk_list_box_row_set_activatable' => 0,
                                                            'gtk_list_box_row_set_header' => 0,
                                                            'gtk_list_box_row_set_selectable' => 0,
                                                            'gtk_list_box_set_header_func' => 0,
                                                            'gtk_main_quit' => 0,
                                                            'gtk_orientable_get_type' => 0,
                                                            'gtk_overlay_get_type' => 0,
                                                            'gtk_popover_bind_model' => 0,
                                                            'gtk_popover_popdown' => 0,
                                                            'gtk_popover_popup' => 0,
                                                            'gtk_progress_bar_set_fraction' => 0,
                                                            'gtk_range_get_value' => 0,
                                                            'gtk_range_set_adjustment' => 0,
                                                            'gtk_range_set_range' => 0,
                                                            'gtk_range_set_value' => 0,
                                                            'gtk_render_background' => 0,
                                                            'gtk_revealer_get_child_revealed' => 0,
                                                            'gtk_revealer_get_reveal_child' => 0,
                                                            'gtk_revealer_set_reveal_child' => 0,
                                                            'gtk_revealer_set_transition_duration' => 0,
                                                            'gtk_revealer_set_transition_type' => 0,
                                                            'gtk_revealer_transition_type_get_type' => 0,
                                                            'gtk_scale_add_mark' => 0,
                                                            'gtk_scale_clear_marks' => 0,
                                                            'gtk_scrolled_window_get_vadjustment' => 0,
                                                            'gtk_search_entry_handle_event' => 0,
                                                            'gtk_separator_new' => 0,
                                                            'gtk_settings_get_default' => 0,
                                                            'gtk_show_uri_on_window' => 0,
                                                            'gtk_size_group_add_widget' => 0,
                                                            'gtk_spinner_start' => 0,
                                                            'gtk_spinner_stop' => 0,
                                                            'gtk_stack_get_type' => 0,
                                                            'gtk_stack_get_visible_child' => 0,
                                                            'gtk_stack_set_visible_child' => 0,
                                                            'gtk_stack_set_visible_child_name' => 0,
                                                            'gtk_style_context_add_class' => 0,
                                                            'gtk_style_context_add_provider_for_screen' => 0,
                                                            'gtk_style_context_get_color' => 0,
                                                            'gtk_style_context_remove_class' => 0,
                                                            'gtk_style_context_remove_provider_for_screen' => 0,
                                                            'gtk_switch_get_active' => 0,
                                                            'gtk_switch_get_state' => 0,
                                                            'gtk_switch_get_type' => 0,
                                                            'gtk_switch_set_active' => 0,
                                                            'gtk_toggle_button_get_active' => 0,
                                                            'gtk_toggle_button_set_active' => 0,
                                                            'gtk_widget_activate' => 0,
                                                            'gtk_widget_add_events' => 0,
                                                            'gtk_widget_add_tick_callback' => 0,
                                                            'gtk_widget_class_bind_template_callback_full' => 0,
                                                            'gtk_widget_class_bind_template_child_full' => 0,
                                                            'gtk_widget_class_set_accessible_role' => 0,
                                                            'gtk_widget_class_set_css_name' => 0,
                                                            'gtk_widget_class_set_template_from_resource' => 0,
                                                            'gtk_widget_destroy' => 0,
                                                            'gtk_widget_destroyed' => 0,
                                                            'gtk_widget_error_bell' => 0,
                                                            'gtk_widget_get_action_group' => 0,
                                                            'gtk_widget_get_allocated_height' => 0,
                                                            'gtk_widget_get_allocated_width' => 0,
                                                            'gtk_widget_get_allocation' => 0,
                                                            'gtk_widget_get_can_focus' => 0,
                                                            'gtk_widget_get_clip' => 0,
                                                            'gtk_widget_get_direction' => 0,
                                                            'gtk_widget_get_display' => 0,
                                                            'gtk_widget_get_frame_clock' => 0,
                                                            'gtk_widget_get_mapped' => 0,
                                                            'gtk_widget_get_margin_bottom' => 0,
                                                            'gtk_widget_get_margin_end' => 0,
                                                            'gtk_widget_get_margin_start' => 0,
                                                            'gtk_widget_get_margin_top' => 0,
                                                            'gtk_widget_get_parent' => 0,
                                                            'gtk_widget_get_preferred_height' => 0,
